zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
/**
 * \brief Component description for PIC32CZ/CA70 AFEC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_AFEC_COMPONENT_H_
#define _PIC32CZ_CA70_AFEC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_AFEC Analog Front-End Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AFEC */
/* ========================================================================== */

/* -------- AFEC_CR : (AFEC Offset: 0x00) (/W 32) AFEC Control Register -------- */

typedef union
{
  struct
  {
    uint32_t SWRST:1;                   /**< bit:      0  Software Reset                                */
    uint32_t START:1;                   /**< bit:      1  Start Conversion                              */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CR_bits_t;

#define AFEC_CR_SWRST_Pos                     (0)                                            /**< (AFEC_CR) Software Reset Position */
#define AFEC_CR_SWRST_Msk                     (0x1U << AFEC_CR_SWRST_Pos)                    /**< (AFEC_CR) Software Reset Mask */
#define AFEC_CR_START_Pos                     (1)                                            /**< (AFEC_CR) Start Conversion Position */
#define AFEC_CR_START_Msk                     (0x1U << AFEC_CR_START_Pos)                    /**< (AFEC_CR) Start Conversion Mask */
#define AFEC_CR_Msk                           (0x00000003UL)                                 /**< (AFEC_CR) Register Mask  */

/* -------- AFEC_MR : (AFEC Offset: 0x04) (R/W 32) AFEC Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t TRGEN:1;                   /**< bit:      0  Trigger Enable                                */
    uint32_t TRGSEL:3;                  /**< bit:   1..3  Trigger Selection                             */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t SLEEP:1;                   /**< bit:      5  Sleep Mode                                    */
    uint32_t FWUP:1;                    /**< bit:      6  Fast Wakeup                                   */
    uint32_t FREERUN:1;                 /**< bit:      7  Free Run Mode                                 */
    uint32_t PRESCAL:8;                 /**< bit:  8..15  Prescaler Rate Selection                      */
    uint32_t STARTUP:4;                 /**< bit: 16..19  Startup Time                                  */
    uint32_t :3;                        /**< bit: 20..22  Reserved                                      */
    uint32_t ONE:1;                     /**< bit:     23  One                                           */
    uint32_t TRACKTIM:4;                /**< bit: 24..27  Tracking Time                                 */
    uint32_t TRANSFER:2;                /**< bit: 28..29  Transfer Period                               */
    uint32_t :1;                        /**< bit:     30  Reserved                                      */
    uint32_t USEQ:1;                    /**< bit:     31  User Sequence Enable                          */
  };
  uint32_t w;
} __AFEC_MR_bits_t;

#define AFEC_MR_TRGEN_Pos                     (0)                                            /**< (AFEC_MR) Trigger Enable Position */
#define AFEC_MR_TRGEN_Msk                     (0x1U << AFEC_MR_TRGEN_Pos)                    /**< (AFEC_MR) Trigger Enable Mask */
#define   AFEC_MR_TRGEN_DIS_Val               (0x0U)                                         /**< (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software.  */
#define   AFEC_MR_TRGEN_EN_Val                (0x1U)                                         /**< (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled.  */
#define AFEC_MR_TRGEN_DIS                     (AFEC_MR_TRGEN_DIS_Val << AFEC_MR_TRGEN_Pos)   /**< (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software. Position  */
#define AFEC_MR_TRGEN_EN                      (AFEC_MR_TRGEN_EN_Val << AFEC_MR_TRGEN_Pos)    /**< (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled. Position  */
#define AFEC_MR_TRGSEL_Pos                    (1)                                            /**< (AFEC_MR) Trigger Selection Position */
#define AFEC_MR_TRGSEL_Msk                    (0x7U << AFEC_MR_TRGSEL_Pos)                   /**< (AFEC_MR) Trigger Selection Mask */
#define AFEC_MR_TRGSEL(value)                 (AFEC_MR_TRGSEL_Msk & ((value) << AFEC_MR_TRGSEL_Pos))
#define   AFEC_MR_TRGSEL_AFEC_TRIG0_Val       (0x0U)                                         /**< (AFEC_MR) AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG1_Val       (0x1U)                                         /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG2_Val       (0x2U)                                         /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG3_Val       (0x3U)                                         /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG4_Val       (0x4U)                                         /**< (AFEC_MR) PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG5_Val       (0x5U)                                         /**< (AFEC_MR) PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG6_Val       (0x6U)                                         /**< (AFEC_MR) Analog Comparator  */
#define AFEC_MR_TRGSEL_AFEC_TRIG0             (AFEC_MR_TRGSEL_AFEC_TRIG0_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG1             (AFEC_MR_TRGSEL_AFEC_TRIG1_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG2             (AFEC_MR_TRGSEL_AFEC_TRIG2_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG3             (AFEC_MR_TRGSEL_AFEC_TRIG3_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG4             (AFEC_MR_TRGSEL_AFEC_TRIG4_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG5             (AFEC_MR_TRGSEL_AFEC_TRIG5_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1 Position  */
#define AFEC_MR_TRGSEL_AFEC_TRIG6             (AFEC_MR_TRGSEL_AFEC_TRIG6_Val << AFEC_MR_TRGSEL_Pos)  /**< (AFEC_MR) Analog Comparator Position  */
#define AFEC_MR_SLEEP_Pos                     (5)                                            /**< (AFEC_MR) Sleep Mode Position */
#define AFEC_MR_SLEEP_Msk                     (0x1U << AFEC_MR_SLEEP_Pos)                    /**< (AFEC_MR) Sleep Mode Mask */
#define   AFEC_MR_SLEEP_NORMAL_Val            (0x0U)                                         /**< (AFEC_MR) Normal mode: The AFE and reference voltage circuitry are kept ON between conversions.  */
#define   AFEC_MR_SLEEP_SLEEP_Val             (0x1U)                                         /**< (AFEC_MR) Sleep mode: The AFE and reference voltage circuitry are OFF between conversions.  */
#define AFEC_MR_SLEEP_NORMAL                  (AFEC_MR_SLEEP_NORMAL_Val << AFEC_MR_SLEEP_Pos)  /**< (AFEC_MR) Normal mode: The AFE and reference voltage circuitry are kept ON between conversions. Position  */
#define AFEC_MR_SLEEP_SLEEP                   (AFEC_MR_SLEEP_SLEEP_Val << AFEC_MR_SLEEP_Pos)  /**< (AFEC_MR) Sleep mode: The AFE and reference voltage circuitry are OFF between conversions. Position  */
#define AFEC_MR_FWUP_Pos                      (6)                                            /**< (AFEC_MR) Fast Wakeup Position */
#define AFEC_MR_FWUP_Msk                      (0x1U << AFEC_MR_FWUP_Pos)                     /**< (AFEC_MR) Fast Wakeup Mask */
#define   AFEC_MR_FWUP_OFF_Val                (0x0U)                                         /**< (AFEC_MR) Normal Sleep mode: The sleep mode is defined by the SLEEP bit.  */
#define   AFEC_MR_FWUP_ON_Val                 (0x1U)                                         /**< (AFEC_MR) Fast akeup Sleep mode: The voltage reference is ON between conversions and AFE is OFF.  */
#define AFEC_MR_FWUP_OFF                      (AFEC_MR_FWUP_OFF_Val << AFEC_MR_FWUP_Pos)     /**< (AFEC_MR) Normal Sleep mode: The sleep mode is defined by the SLEEP bit. Position  */
#define AFEC_MR_FWUP_ON                       (AFEC_MR_FWUP_ON_Val << AFEC_MR_FWUP_Pos)      /**< (AFEC_MR) Fast akeup Sleep mode: The voltage reference is ON between conversions and AFE is OFF. Position  */
#define AFEC_MR_FREERUN_Pos                   (7)                                            /**< (AFEC_MR) Free Run Mode Position */
#define AFEC_MR_FREERUN_Msk                   (0x1U << AFEC_MR_FREERUN_Pos)                  /**< (AFEC_MR) Free Run Mode Mask */
#define   AFEC_MR_FREERUN_OFF_Val             (0x0U)                                         /**< (AFEC_MR) Normal mode  */
#define   AFEC_MR_FREERUN_ON_Val              (0x1U)                                         /**< (AFEC_MR) Free Run mode: Never wait for any trigger.  */
#define AFEC_MR_FREERUN_OFF                   (AFEC_MR_FREERUN_OFF_Val << AFEC_MR_FREERUN_Pos)  /**< (AFEC_MR) Normal mode Position  */
#define AFEC_MR_FREERUN_ON                    (AFEC_MR_FREERUN_ON_Val << AFEC_MR_FREERUN_Pos)  /**< (AFEC_MR) Free Run mode: Never wait for any trigger. Position  */
#define AFEC_MR_PRESCAL_Pos                   (8)                                            /**< (AFEC_MR) Prescaler Rate Selection Position */
#define AFEC_MR_PRESCAL_Msk                   (0xFFU << AFEC_MR_PRESCAL_Pos)                 /**< (AFEC_MR) Prescaler Rate Selection Mask */
#define AFEC_MR_PRESCAL(value)                (AFEC_MR_PRESCAL_Msk & ((value) << AFEC_MR_PRESCAL_Pos))
#define AFEC_MR_STARTUP_Pos                   (16)                                           /**< (AFEC_MR) Startup Time Position */
#define AFEC_MR_STARTUP_Msk                   (0xFU << AFEC_MR_STARTUP_Pos)                  /**< (AFEC_MR) Startup Time Mask */
#define AFEC_MR_STARTUP(value)                (AFEC_MR_STARTUP_Msk & ((value) << AFEC_MR_STARTUP_Pos))
#define   AFEC_MR_STARTUP_SUT0_Val            (0x0U)                                         /**< (AFEC_MR) 0 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT8_Val            (0x1U)                                         /**< (AFEC_MR) 8 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT16_Val           (0x2U)                                         /**< (AFEC_MR) 16 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT24_Val           (0x3U)                                         /**< (AFEC_MR) 24 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT64_Val           (0x4U)                                         /**< (AFEC_MR) 64 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT80_Val           (0x5U)                                         /**< (AFEC_MR) 80 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT96_Val           (0x6U)                                         /**< (AFEC_MR) 96 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT112_Val          (0x7U)                                         /**< (AFEC_MR) 112 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT512_Val          (0x8U)                                         /**< (AFEC_MR) 512 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT576_Val          (0x9U)                                         /**< (AFEC_MR) 576 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT640_Val          (0xAU)                                         /**< (AFEC_MR) 640 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT704_Val          (0xBU)                                         /**< (AFEC_MR) 704 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT768_Val          (0xCU)                                         /**< (AFEC_MR) 768 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT832_Val          (0xDU)                                         /**< (AFEC_MR) 832 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT896_Val          (0xEU)                                         /**< (AFEC_MR) 896 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT960_Val          (0xFU)                                         /**< (AFEC_MR) 960 periods of AFE clock  */
#define AFEC_MR_STARTUP_SUT0                  (AFEC_MR_STARTUP_SUT0_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 0 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT8                  (AFEC_MR_STARTUP_SUT8_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 8 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT16                 (AFEC_MR_STARTUP_SUT16_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 16 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT24                 (AFEC_MR_STARTUP_SUT24_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 24 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT64                 (AFEC_MR_STARTUP_SUT64_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 64 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT80                 (AFEC_MR_STARTUP_SUT80_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 80 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT96                 (AFEC_MR_STARTUP_SUT96_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 96 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT112                (AFEC_MR_STARTUP_SUT112_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 112 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT512                (AFEC_MR_STARTUP_SUT512_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 512 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT576                (AFEC_MR_STARTUP_SUT576_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 576 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT640                (AFEC_MR_STARTUP_SUT640_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 640 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT704                (AFEC_MR_STARTUP_SUT704_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 704 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT768                (AFEC_MR_STARTUP_SUT768_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 768 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT832                (AFEC_MR_STARTUP_SUT832_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 832 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT896                (AFEC_MR_STARTUP_SUT896_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 896 periods of AFE clock Position  */
#define AFEC_MR_STARTUP_SUT960                (AFEC_MR_STARTUP_SUT960_Val << AFEC_MR_STARTUP_Pos)  /**< (AFEC_MR) 960 periods of AFE clock Position  */
#define AFEC_MR_ONE_Pos                       (23)                                           /**< (AFEC_MR) One Position */
#define AFEC_MR_ONE_Msk                       (0x1U << AFEC_MR_ONE_Pos)                      /**< (AFEC_MR) One Mask */
#define AFEC_MR_TRACKTIM_Pos                  (24)                                           /**< (AFEC_MR) Tracking Time Position */
#define AFEC_MR_TRACKTIM_Msk                  (0xFU << AFEC_MR_TRACKTIM_Pos)                 /**< (AFEC_MR) Tracking Time Mask */
#define AFEC_MR_TRACKTIM(value)               (AFEC_MR_TRACKTIM_Msk & ((value) << AFEC_MR_TRACKTIM_Pos))
#define AFEC_MR_TRANSFER_Pos                  (28)                                           /**< (AFEC_MR) Transfer Period Position */
#define AFEC_MR_TRANSFER_Msk                  (0x3U << AFEC_MR_TRANSFER_Pos)                 /**< (AFEC_MR) Transfer Period Mask */
#define AFEC_MR_TRANSFER(value)               (AFEC_MR_TRANSFER_Msk & ((value) << AFEC_MR_TRANSFER_Pos))
#define AFEC_MR_USEQ_Pos                      (31)                                           /**< (AFEC_MR) User Sequence Enable Position */
#define AFEC_MR_USEQ_Msk                      (0x1U << AFEC_MR_USEQ_Pos)                     /**< (AFEC_MR) User Sequence Enable Mask */
#define   AFEC_MR_USEQ_NUM_ORDER_Val          (0x0U)                                         /**< (AFEC_MR) Normal mode: The controller converts channels in a simple numeric order.  */
#define   AFEC_MR_USEQ_REG_ORDER_Val          (0x1U)                                         /**< (AFEC_MR) User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R.  */
#define AFEC_MR_USEQ_NUM_ORDER                (AFEC_MR_USEQ_NUM_ORDER_Val << AFEC_MR_USEQ_Pos)  /**< (AFEC_MR) Normal mode: The controller converts channels in a simple numeric order. Position  */
#define AFEC_MR_USEQ_REG_ORDER                (AFEC_MR_USEQ_REG_ORDER_Val << AFEC_MR_USEQ_Pos)  /**< (AFEC_MR) User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R. Position  */
#define AFEC_MR_Msk                           (0xBF8FFFEFUL)                                 /**< (AFEC_MR) Register Mask  */

/* -------- AFEC_EMR : (AFEC Offset: 0x08) (R/W 32) AFEC Extended Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t CMPMODE:2;                 /**< bit:   0..1  Comparison Mode                               */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t CMPSEL:5;                  /**< bit:   3..7  Comparison Selected Channel                   */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t CMPALL:1;                  /**< bit:      9  Compare All Channels                          */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t CMPFILTER:2;               /**< bit: 12..13  Compare Event Filtering                       */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t RES:3;                     /**< bit: 16..18  Resolution                                    */
    uint32_t :5;                        /**< bit: 19..23  Reserved                                      */
    uint32_t TAG:1;                     /**< bit:     24  TAG of the AFEC_LDCR                          */
    uint32_t STM:1;                     /**< bit:     25  Single Trigger Mode                           */
    uint32_t :2;                        /**< bit: 26..27  Reserved                                      */
    uint32_t SIGNMODE:2;                /**< bit: 28..29  Sign Mode                                     */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_EMR_bits_t;

