zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
#define AFEC_EMR_CMPMODE_Pos                  (0)                                            /**< (AFEC_EMR) Comparison Mode Position */
#define AFEC_EMR_CMPMODE_Msk                  (0x3U << AFEC_EMR_CMPMODE_Pos)                 /**< (AFEC_EMR) Comparison Mode Mask */
#define AFEC_EMR_CMPMODE(value)               (AFEC_EMR_CMPMODE_Msk & ((value) << AFEC_EMR_CMPMODE_Pos))
#define   AFEC_EMR_CMPMODE_LOW_Val            (0x0U)                                         /**< (AFEC_EMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   AFEC_EMR_CMPMODE_HIGH_Val           (0x1U)                                         /**< (AFEC_EMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   AFEC_EMR_CMPMODE_IN_Val             (0x2U)                                         /**< (AFEC_EMR) Generates an event when the converted data is in the comparison window.  */
#define   AFEC_EMR_CMPMODE_OUT_Val            (0x3U)                                         /**< (AFEC_EMR) Generates an event when the converted data is out of the comparison window.  */
#define AFEC_EMR_CMPMODE_LOW                  (AFEC_EMR_CMPMODE_LOW_Val << AFEC_EMR_CMPMODE_Pos)  /**< (AFEC_EMR) Generates an event when the converted data is lower than the low threshold of the window. Position  */
#define AFEC_EMR_CMPMODE_HIGH                 (AFEC_EMR_CMPMODE_HIGH_Val << AFEC_EMR_CMPMODE_Pos)  /**< (AFEC_EMR) Generates an event when the converted data is higher than the high threshold of the window. Position  */
#define AFEC_EMR_CMPMODE_IN                   (AFEC_EMR_CMPMODE_IN_Val << AFEC_EMR_CMPMODE_Pos)  /**< (AFEC_EMR) Generates an event when the converted data is in the comparison window. Position  */
#define AFEC_EMR_CMPMODE_OUT                  (AFEC_EMR_CMPMODE_OUT_Val << AFEC_EMR_CMPMODE_Pos)  /**< (AFEC_EMR) Generates an event when the converted data is out of the comparison window. Position  */
#define AFEC_EMR_CMPSEL_Pos                   (3)                                            /**< (AFEC_EMR) Comparison Selected Channel Position */
#define AFEC_EMR_CMPSEL_Msk                   (0x1FU << AFEC_EMR_CMPSEL_Pos)                 /**< (AFEC_EMR) Comparison Selected Channel Mask */
#define AFEC_EMR_CMPSEL(value)                (AFEC_EMR_CMPSEL_Msk & ((value) << AFEC_EMR_CMPSEL_Pos))
#define AFEC_EMR_CMPALL_Pos                   (9)                                            /**< (AFEC_EMR) Compare All Channels Position */
#define AFEC_EMR_CMPALL_Msk                   (0x1U << AFEC_EMR_CMPALL_Pos)                  /**< (AFEC_EMR) Compare All Channels Mask */
#define AFEC_EMR_CMPFILTER_Pos                (12)                                           /**< (AFEC_EMR) Compare Event Filtering Position */
#define AFEC_EMR_CMPFILTER_Msk                (0x3U << AFEC_EMR_CMPFILTER_Pos)               /**< (AFEC_EMR) Compare Event Filtering Mask */
#define AFEC_EMR_CMPFILTER(value)             (AFEC_EMR_CMPFILTER_Msk & ((value) << AFEC_EMR_CMPFILTER_Pos))
#define AFEC_EMR_RES_Pos                      (16)                                           /**< (AFEC_EMR) Resolution Position */
#define AFEC_EMR_RES_Msk                      (0x7U << AFEC_EMR_RES_Pos)                     /**< (AFEC_EMR) Resolution Mask */
#define AFEC_EMR_RES(value)                   (AFEC_EMR_RES_Msk & ((value) << AFEC_EMR_RES_Pos))
#define   AFEC_EMR_RES_NO_AVERAGE_Val         (0x0U)                                         /**< (AFEC_EMR) 12-bit resolution, AFE sample rate is maximum (no averaging).  */
#define   AFEC_EMR_RES_OSR4_Val               (0x2U)                                         /**< (AFEC_EMR) 13-bit resolution, AFE sample rate divided by 4 (averaging).  */
#define   AFEC_EMR_RES_OSR16_Val              (0x3U)                                         /**< (AFEC_EMR) 14-bit resolution, AFE sample rate divided by 16 (averaging).  */
#define   AFEC_EMR_RES_OSR64_Val              (0x4U)                                         /**< (AFEC_EMR) 15-bit resolution, AFE sample rate divided by 64 (averaging).  */
#define   AFEC_EMR_RES_OSR256_Val             (0x5U)                                         /**< (AFEC_EMR) 16-bit resolution, AFE sample rate divided by 256 (averaging).  */
#define AFEC_EMR_RES_NO_AVERAGE               (AFEC_EMR_RES_NO_AVERAGE_Val << AFEC_EMR_RES_Pos)  /**< (AFEC_EMR) 12-bit resolution, AFE sample rate is maximum (no averaging). Position  */
#define AFEC_EMR_RES_OSR4                     (AFEC_EMR_RES_OSR4_Val << AFEC_EMR_RES_Pos)    /**< (AFEC_EMR) 13-bit resolution, AFE sample rate divided by 4 (averaging). Position  */
#define AFEC_EMR_RES_OSR16                    (AFEC_EMR_RES_OSR16_Val << AFEC_EMR_RES_Pos)   /**< (AFEC_EMR) 14-bit resolution, AFE sample rate divided by 16 (averaging). Position  */
#define AFEC_EMR_RES_OSR64                    (AFEC_EMR_RES_OSR64_Val << AFEC_EMR_RES_Pos)   /**< (AFEC_EMR) 15-bit resolution, AFE sample rate divided by 64 (averaging). Position  */
#define AFEC_EMR_RES_OSR256                   (AFEC_EMR_RES_OSR256_Val << AFEC_EMR_RES_Pos)  /**< (AFEC_EMR) 16-bit resolution, AFE sample rate divided by 256 (averaging). Position  */
#define AFEC_EMR_TAG_Pos                      (24)                                           /**< (AFEC_EMR) TAG of the AFEC_LDCR Position */
#define AFEC_EMR_TAG_Msk                      (0x1U << AFEC_EMR_TAG_Pos)                     /**< (AFEC_EMR) TAG of the AFEC_LDCR Mask */
#define AFEC_EMR_STM_Pos                      (25)                                           /**< (AFEC_EMR) Single Trigger Mode Position */
#define AFEC_EMR_STM_Msk                      (0x1U << AFEC_EMR_STM_Pos)                     /**< (AFEC_EMR) Single Trigger Mode Mask */
#define AFEC_EMR_SIGNMODE_Pos                 (28)                                           /**< (AFEC_EMR) Sign Mode Position */
#define AFEC_EMR_SIGNMODE_Msk                 (0x3U << AFEC_EMR_SIGNMODE_Pos)                /**< (AFEC_EMR) Sign Mode Mask */
#define AFEC_EMR_SIGNMODE(value)              (AFEC_EMR_SIGNMODE_Msk & ((value) << AFEC_EMR_SIGNMODE_Pos))
#define   AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN_Val (0x0U)                                         /**< (AFEC_EMR) Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions.  */
#define   AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG_Val (0x1U)                                         /**< (AFEC_EMR) Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions.  */
#define   AFEC_EMR_SIGNMODE_ALL_UNSIGNED_Val  (0x2U)                                         /**< (AFEC_EMR) All channels: Unsigned conversions.  */
#define   AFEC_EMR_SIGNMODE_ALL_SIGNED_Val    (0x3U)                                         /**< (AFEC_EMR) All channels: Signed conversions.  */
#define AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN     (AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN_Val << AFEC_EMR_SIGNMODE_Pos)  /**< (AFEC_EMR) Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions. Position  */
#define AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG     (AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG_Val << AFEC_EMR_SIGNMODE_Pos)  /**< (AFEC_EMR) Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions. Position  */
#define AFEC_EMR_SIGNMODE_ALL_UNSIGNED        (AFEC_EMR_SIGNMODE_ALL_UNSIGNED_Val << AFEC_EMR_SIGNMODE_Pos)  /**< (AFEC_EMR) All channels: Unsigned conversions. Position  */
#define AFEC_EMR_SIGNMODE_ALL_SIGNED          (AFEC_EMR_SIGNMODE_ALL_SIGNED_Val << AFEC_EMR_SIGNMODE_Pos)  /**< (AFEC_EMR) All channels: Signed conversions. Position  */
#define AFEC_EMR_Msk                          (0x330732FBUL)                                 /**< (AFEC_EMR) Register Mask  */

/* -------- AFEC_SEQ1R : (AFEC Offset: 0x0c) (R/W 32) AFEC Channel Sequence 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t USCH0:4;                   /**< bit:   0..3  User Sequence Number 0                        */
    uint32_t USCH1:4;                   /**< bit:   4..7  User Sequence Number 1                        */
    uint32_t USCH2:4;                   /**< bit:  8..11  User Sequence Number 2                        */
    uint32_t USCH3:4;                   /**< bit: 12..15  User Sequence Number 3                        */
    uint32_t USCH4:4;                   /**< bit: 16..19  User Sequence Number 4                        */
    uint32_t USCH5:4;                   /**< bit: 20..23  User Sequence Number 5                        */
    uint32_t USCH6:4;                   /**< bit: 24..27  User Sequence Number 6                        */
    uint32_t USCH7:4;                   /**< bit: 28..31  User Sequence Number 7                        */
  };
  uint32_t w;
} __AFEC_SEQ1R_bits_t;

#define AFEC_SEQ1R_USCH0_Pos                  (0)                                            /**< (AFEC_SEQ1R) User Sequence Number 0 Position */
#define AFEC_SEQ1R_USCH0_Msk                  (0xFU << AFEC_SEQ1R_USCH0_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 0 Mask */
#define AFEC_SEQ1R_USCH0(value)               (AFEC_SEQ1R_USCH0_Msk & ((value) << AFEC_SEQ1R_USCH0_Pos))
#define AFEC_SEQ1R_USCH1_Pos                  (4)                                            /**< (AFEC_SEQ1R) User Sequence Number 1 Position */
#define AFEC_SEQ1R_USCH1_Msk                  (0xFU << AFEC_SEQ1R_USCH1_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 1 Mask */
#define AFEC_SEQ1R_USCH1(value)               (AFEC_SEQ1R_USCH1_Msk & ((value) << AFEC_SEQ1R_USCH1_Pos))
#define AFEC_SEQ1R_USCH2_Pos                  (8)                                            /**< (AFEC_SEQ1R) User Sequence Number 2 Position */
#define AFEC_SEQ1R_USCH2_Msk                  (0xFU << AFEC_SEQ1R_USCH2_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 2 Mask */
#define AFEC_SEQ1R_USCH2(value)               (AFEC_SEQ1R_USCH2_Msk & ((value) << AFEC_SEQ1R_USCH2_Pos))
#define AFEC_SEQ1R_USCH3_Pos                  (12)                                           /**< (AFEC_SEQ1R) User Sequence Number 3 Position */
#define AFEC_SEQ1R_USCH3_Msk                  (0xFU << AFEC_SEQ1R_USCH3_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 3 Mask */
#define AFEC_SEQ1R_USCH3(value)               (AFEC_SEQ1R_USCH3_Msk & ((value) << AFEC_SEQ1R_USCH3_Pos))
#define AFEC_SEQ1R_USCH4_Pos                  (16)                                           /**< (AFEC_SEQ1R) User Sequence Number 4 Position */
#define AFEC_SEQ1R_USCH4_Msk                  (0xFU << AFEC_SEQ1R_USCH4_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 4 Mask */
#define AFEC_SEQ1R_USCH4(value)               (AFEC_SEQ1R_USCH4_Msk & ((value) << AFEC_SEQ1R_USCH4_Pos))
#define AFEC_SEQ1R_USCH5_Pos                  (20)                                           /**< (AFEC_SEQ1R) User Sequence Number 5 Position */
#define AFEC_SEQ1R_USCH5_Msk                  (0xFU << AFEC_SEQ1R_USCH5_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 5 Mask */
#define AFEC_SEQ1R_USCH5(value)               (AFEC_SEQ1R_USCH5_Msk & ((value) << AFEC_SEQ1R_USCH5_Pos))
#define AFEC_SEQ1R_USCH6_Pos                  (24)                                           /**< (AFEC_SEQ1R) User Sequence Number 6 Position */
#define AFEC_SEQ1R_USCH6_Msk                  (0xFU << AFEC_SEQ1R_USCH6_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 6 Mask */
#define AFEC_SEQ1R_USCH6(value)               (AFEC_SEQ1R_USCH6_Msk & ((value) << AFEC_SEQ1R_USCH6_Pos))
#define AFEC_SEQ1R_USCH7_Pos                  (28)                                           /**< (AFEC_SEQ1R) User Sequence Number 7 Position */
#define AFEC_SEQ1R_USCH7_Msk                  (0xFU << AFEC_SEQ1R_USCH7_Pos)                 /**< (AFEC_SEQ1R) User Sequence Number 7 Mask */
#define AFEC_SEQ1R_USCH7(value)               (AFEC_SEQ1R_USCH7_Msk & ((value) << AFEC_SEQ1R_USCH7_Pos))
#define AFEC_SEQ1R_Msk                        (0xFFFFFFFFUL)                                 /**< (AFEC_SEQ1R) Register Mask  */

/* -------- AFEC_SEQ2R : (AFEC Offset: 0x10) (R/W 32) AFEC Channel Sequence 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t USCH8:4;                   /**< bit:   0..3  User Sequence Number 8                        */
    uint32_t USCH9:4;                   /**< bit:   4..7  User Sequence Number 9                        */
    uint32_t USCH10:4;                  /**< bit:  8..11  User Sequence Number 10                       */
    uint32_t USCH11:4;                  /**< bit: 12..15  User Sequence Number 11                       */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_SEQ2R_bits_t;

#define AFEC_SEQ2R_USCH8_Pos                  (0)                                            /**< (AFEC_SEQ2R) User Sequence Number 8 Position */
#define AFEC_SEQ2R_USCH8_Msk                  (0xFU << AFEC_SEQ2R_USCH8_Pos)                 /**< (AFEC_SEQ2R) User Sequence Number 8 Mask */
#define AFEC_SEQ2R_USCH8(value)               (AFEC_SEQ2R_USCH8_Msk & ((value) << AFEC_SEQ2R_USCH8_Pos))
#define AFEC_SEQ2R_USCH9_Pos                  (4)                                            /**< (AFEC_SEQ2R) User Sequence Number 9 Position */
#define AFEC_SEQ2R_USCH9_Msk                  (0xFU << AFEC_SEQ2R_USCH9_Pos)                 /**< (AFEC_SEQ2R) User Sequence Number 9 Mask */
#define AFEC_SEQ2R_USCH9(value)               (AFEC_SEQ2R_USCH9_Msk & ((value) << AFEC_SEQ2R_USCH9_Pos))
#define AFEC_SEQ2R_USCH10_Pos                 (8)                                            /**< (AFEC_SEQ2R) User Sequence Number 10 Position */
#define AFEC_SEQ2R_USCH10_Msk                 (0xFU << AFEC_SEQ2R_USCH10_Pos)                /**< (AFEC_SEQ2R) User Sequence Number 10 Mask */
#define AFEC_SEQ2R_USCH10(value)              (AFEC_SEQ2R_USCH10_Msk & ((value) << AFEC_SEQ2R_USCH10_Pos))
#define AFEC_SEQ2R_USCH11_Pos                 (12)                                           /**< (AFEC_SEQ2R) User Sequence Number 11 Position */
#define AFEC_SEQ2R_USCH11_Msk                 (0xFU << AFEC_SEQ2R_USCH11_Pos)                /**< (AFEC_SEQ2R) User Sequence Number 11 Mask */
#define AFEC_SEQ2R_USCH11(value)              (AFEC_SEQ2R_USCH11_Msk & ((value) << AFEC_SEQ2R_USCH11_Pos))
#define AFEC_SEQ2R_Msk                        (0x0000FFFFUL)                                 /**< (AFEC_SEQ2R) Register Mask  */

/* -------- AFEC_CHER : (AFEC Offset: 0x14) (/W 32) AFEC Channel Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Enable                              */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Enable                              */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Enable                              */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Enable                              */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Enable                              */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Enable                              */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Enable                              */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Enable                              */
    uint32_t CH8:1;                     /**< bit:      8  Channel 8 Enable                              */
    uint32_t CH9:1;                     /**< bit:      9  Channel 9 Enable                              */
    uint32_t CH10:1;                    /**< bit:     10  Channel 10 Enable                             */
    uint32_t CH11:1;                    /**< bit:     11  Channel 11 Enable                             */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t CH:12;                     /**< bit:  0..11  Channel xx Enable                             */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CHER_bits_t;

#define AFEC_CHER_CH0_Pos                     (0)                                            /**< (AFEC_CHER) Channel 0 Enable Position */
#define AFEC_CHER_CH0_Msk                     (0x1U << AFEC_CHER_CH0_Pos)                    /**< (AFEC_CHER) Channel 0 Enable Mask */
#define AFEC_CHER_CH1_Pos                     (1)                                            /**< (AFEC_CHER) Channel 1 Enable Position */
#define AFEC_CHER_CH1_Msk                     (0x1U << AFEC_CHER_CH1_Pos)                    /**< (AFEC_CHER) Channel 1 Enable Mask */
#define AFEC_CHER_CH2_Pos                     (2)                                            /**< (AFEC_CHER) Channel 2 Enable Position */
#define AFEC_CHER_CH2_Msk                     (0x1U << AFEC_CHER_CH2_Pos)                    /**< (AFEC_CHER) Channel 2 Enable Mask */
#define AFEC_CHER_CH3_Pos                     (3)                                            /**< (AFEC_CHER) Channel 3 Enable Position */
#define AFEC_CHER_CH3_Msk                     (0x1U << AFEC_CHER_CH3_Pos)                    /**< (AFEC_CHER) Channel 3 Enable Mask */
#define AFEC_CHER_CH4_Pos                     (4)                                            /**< (AFEC_CHER) Channel 4 Enable Position */
#define AFEC_CHER_CH4_Msk                     (0x1U << AFEC_CHER_CH4_Pos)                    /**< (AFEC_CHER) Channel 4 Enable Mask */
#define AFEC_CHER_CH5_Pos                     (5)                                            /**< (AFEC_CHER) Channel 5 Enable Position */
#define AFEC_CHER_CH5_Msk                     (0x1U << AFEC_CHER_CH5_Pos)                    /**< (AFEC_CHER) Channel 5 Enable Mask */
#define AFEC_CHER_CH6_Pos                     (6)                                            /**< (AFEC_CHER) Channel 6 Enable Position */
#define AFEC_CHER_CH6_Msk                     (0x1U << AFEC_CHER_CH6_Pos)                    /**< (AFEC_CHER) Channel 6 Enable Mask */
#define AFEC_CHER_CH7_Pos                     (7)                                            /**< (AFEC_CHER) Channel 7 Enable Position */
#define AFEC_CHER_CH7_Msk                     (0x1U << AFEC_CHER_CH7_Pos)                    /**< (AFEC_CHER) Channel 7 Enable Mask */
#define AFEC_CHER_CH8_Pos                     (8)                                            /**< (AFEC_CHER) Channel 8 Enable Position */
#define AFEC_CHER_CH8_Msk                     (0x1U << AFEC_CHER_CH8_Pos)                    /**< (AFEC_CHER) Channel 8 Enable Mask */
#define AFEC_CHER_CH9_Pos                     (9)                                            /**< (AFEC_CHER) Channel 9 Enable Position */
#define AFEC_CHER_CH9_Msk                     (0x1U << AFEC_CHER_CH9_Pos)                    /**< (AFEC_CHER) Channel 9 Enable Mask */
#define AFEC_CHER_CH10_Pos                    (10)                                           /**< (AFEC_CHER) Channel 10 Enable Position */
#define AFEC_CHER_CH10_Msk                    (0x1U << AFEC_CHER_CH10_Pos)                   /**< (AFEC_CHER) Channel 10 Enable Mask */
#define AFEC_CHER_CH11_Pos                    (11)                                           /**< (AFEC_CHER) Channel 11 Enable Position */
#define AFEC_CHER_CH11_Msk                    (0x1U << AFEC_CHER_CH11_Pos)                   /**< (AFEC_CHER) Channel 11 Enable Mask */
#define AFEC_CHER_Msk                         (0x00000FFFUL)                                 /**< (AFEC_CHER) Register Mask  */
#define AFEC_CHER_CH_Pos                      (0)                                            /**< (AFEC_CHER Position) Channel xx Enable */
#define AFEC_CHER_CH_Msk                      (0xFFFU << AFEC_CHER_CH_Pos)                   /**< (AFEC_CHER Mask) CH */
#define AFEC_CHER_CH(value)                   (AFEC_CHER_CH_Msk & ((value) << AFEC_CHER_CH_Pos))

