zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
/* -------- AFEC_CHDR : (AFEC Offset: 0x18) (/W 32) AFEC Channel Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Disable                             */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Disable                             */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Disable                             */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Disable                             */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Disable                             */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Disable                             */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Disable                             */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Disable                             */
    uint32_t CH8:1;                     /**< bit:      8  Channel 8 Disable                             */
    uint32_t CH9:1;                     /**< bit:      9  Channel 9 Disable                             */
    uint32_t CH10:1;                    /**< bit:     10  Channel 10 Disable                            */
    uint32_t CH11:1;                    /**< bit:     11  Channel 11 Disable                            */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t CH:12;                     /**< bit:  0..11  Channel xx Disable                            */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CHDR_bits_t;

#define AFEC_CHDR_CH0_Pos                     (0)                                            /**< (AFEC_CHDR) Channel 0 Disable Position */
#define AFEC_CHDR_CH0_Msk                     (0x1U << AFEC_CHDR_CH0_Pos)                    /**< (AFEC_CHDR) Channel 0 Disable Mask */
#define AFEC_CHDR_CH1_Pos                     (1)                                            /**< (AFEC_CHDR) Channel 1 Disable Position */
#define AFEC_CHDR_CH1_Msk                     (0x1U << AFEC_CHDR_CH1_Pos)                    /**< (AFEC_CHDR) Channel 1 Disable Mask */
#define AFEC_CHDR_CH2_Pos                     (2)                                            /**< (AFEC_CHDR) Channel 2 Disable Position */
#define AFEC_CHDR_CH2_Msk                     (0x1U << AFEC_CHDR_CH2_Pos)                    /**< (AFEC_CHDR) Channel 2 Disable Mask */
#define AFEC_CHDR_CH3_Pos                     (3)                                            /**< (AFEC_CHDR) Channel 3 Disable Position */
#define AFEC_CHDR_CH3_Msk                     (0x1U << AFEC_CHDR_CH3_Pos)                    /**< (AFEC_CHDR) Channel 3 Disable Mask */
#define AFEC_CHDR_CH4_Pos                     (4)                                            /**< (AFEC_CHDR) Channel 4 Disable Position */
#define AFEC_CHDR_CH4_Msk                     (0x1U << AFEC_CHDR_CH4_Pos)                    /**< (AFEC_CHDR) Channel 4 Disable Mask */
#define AFEC_CHDR_CH5_Pos                     (5)                                            /**< (AFEC_CHDR) Channel 5 Disable Position */
#define AFEC_CHDR_CH5_Msk                     (0x1U << AFEC_CHDR_CH5_Pos)                    /**< (AFEC_CHDR) Channel 5 Disable Mask */
#define AFEC_CHDR_CH6_Pos                     (6)                                            /**< (AFEC_CHDR) Channel 6 Disable Position */
#define AFEC_CHDR_CH6_Msk                     (0x1U << AFEC_CHDR_CH6_Pos)                    /**< (AFEC_CHDR) Channel 6 Disable Mask */
#define AFEC_CHDR_CH7_Pos                     (7)                                            /**< (AFEC_CHDR) Channel 7 Disable Position */
#define AFEC_CHDR_CH7_Msk                     (0x1U << AFEC_CHDR_CH7_Pos)                    /**< (AFEC_CHDR) Channel 7 Disable Mask */
#define AFEC_CHDR_CH8_Pos                     (8)                                            /**< (AFEC_CHDR) Channel 8 Disable Position */
#define AFEC_CHDR_CH8_Msk                     (0x1U << AFEC_CHDR_CH8_Pos)                    /**< (AFEC_CHDR) Channel 8 Disable Mask */
#define AFEC_CHDR_CH9_Pos                     (9)                                            /**< (AFEC_CHDR) Channel 9 Disable Position */
#define AFEC_CHDR_CH9_Msk                     (0x1U << AFEC_CHDR_CH9_Pos)                    /**< (AFEC_CHDR) Channel 9 Disable Mask */
#define AFEC_CHDR_CH10_Pos                    (10)                                           /**< (AFEC_CHDR) Channel 10 Disable Position */
#define AFEC_CHDR_CH10_Msk                    (0x1U << AFEC_CHDR_CH10_Pos)                   /**< (AFEC_CHDR) Channel 10 Disable Mask */
#define AFEC_CHDR_CH11_Pos                    (11)                                           /**< (AFEC_CHDR) Channel 11 Disable Position */
#define AFEC_CHDR_CH11_Msk                    (0x1U << AFEC_CHDR_CH11_Pos)                   /**< (AFEC_CHDR) Channel 11 Disable Mask */
#define AFEC_CHDR_Msk                         (0x00000FFFUL)                                 /**< (AFEC_CHDR) Register Mask  */
#define AFEC_CHDR_CH_Pos                      (0)                                            /**< (AFEC_CHDR Position) Channel xx Disable */
#define AFEC_CHDR_CH_Msk                      (0xFFFU << AFEC_CHDR_CH_Pos)                   /**< (AFEC_CHDR Mask) CH */
#define AFEC_CHDR_CH(value)                   (AFEC_CHDR_CH_Msk & ((value) << AFEC_CHDR_CH_Pos))

/* -------- AFEC_CHSR : (AFEC Offset: 0x1c) (R/ 32) AFEC Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Status                              */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Status                              */
    uint32_t CH2:1;                     /**< bit:      2  Channel 2 Status                              */
    uint32_t CH3:1;                     /**< bit:      3  Channel 3 Status                              */
    uint32_t CH4:1;                     /**< bit:      4  Channel 4 Status                              */
    uint32_t CH5:1;                     /**< bit:      5  Channel 5 Status                              */
    uint32_t CH6:1;                     /**< bit:      6  Channel 6 Status                              */
    uint32_t CH7:1;                     /**< bit:      7  Channel 7 Status                              */
    uint32_t CH8:1;                     /**< bit:      8  Channel 8 Status                              */
    uint32_t CH9:1;                     /**< bit:      9  Channel 9 Status                              */
    uint32_t CH10:1;                    /**< bit:     10  Channel 10 Status                             */
    uint32_t CH11:1;                    /**< bit:     11  Channel 11 Status                             */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t CH:12;                     /**< bit:  0..11  Channel xx Status                             */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CHSR_bits_t;

#define AFEC_CHSR_CH0_Pos                     (0)                                            /**< (AFEC_CHSR) Channel 0 Status Position */
#define AFEC_CHSR_CH0_Msk                     (0x1U << AFEC_CHSR_CH0_Pos)                    /**< (AFEC_CHSR) Channel 0 Status Mask */
#define AFEC_CHSR_CH1_Pos                     (1)                                            /**< (AFEC_CHSR) Channel 1 Status Position */
#define AFEC_CHSR_CH1_Msk                     (0x1U << AFEC_CHSR_CH1_Pos)                    /**< (AFEC_CHSR) Channel 1 Status Mask */
#define AFEC_CHSR_CH2_Pos                     (2)                                            /**< (AFEC_CHSR) Channel 2 Status Position */
#define AFEC_CHSR_CH2_Msk                     (0x1U << AFEC_CHSR_CH2_Pos)                    /**< (AFEC_CHSR) Channel 2 Status Mask */
#define AFEC_CHSR_CH3_Pos                     (3)                                            /**< (AFEC_CHSR) Channel 3 Status Position */
#define AFEC_CHSR_CH3_Msk                     (0x1U << AFEC_CHSR_CH3_Pos)                    /**< (AFEC_CHSR) Channel 3 Status Mask */
#define AFEC_CHSR_CH4_Pos                     (4)                                            /**< (AFEC_CHSR) Channel 4 Status Position */
#define AFEC_CHSR_CH4_Msk                     (0x1U << AFEC_CHSR_CH4_Pos)                    /**< (AFEC_CHSR) Channel 4 Status Mask */
#define AFEC_CHSR_CH5_Pos                     (5)                                            /**< (AFEC_CHSR) Channel 5 Status Position */
#define AFEC_CHSR_CH5_Msk                     (0x1U << AFEC_CHSR_CH5_Pos)                    /**< (AFEC_CHSR) Channel 5 Status Mask */
#define AFEC_CHSR_CH6_Pos                     (6)                                            /**< (AFEC_CHSR) Channel 6 Status Position */
#define AFEC_CHSR_CH6_Msk                     (0x1U << AFEC_CHSR_CH6_Pos)                    /**< (AFEC_CHSR) Channel 6 Status Mask */
#define AFEC_CHSR_CH7_Pos                     (7)                                            /**< (AFEC_CHSR) Channel 7 Status Position */
#define AFEC_CHSR_CH7_Msk                     (0x1U << AFEC_CHSR_CH7_Pos)                    /**< (AFEC_CHSR) Channel 7 Status Mask */
#define AFEC_CHSR_CH8_Pos                     (8)                                            /**< (AFEC_CHSR) Channel 8 Status Position */
#define AFEC_CHSR_CH8_Msk                     (0x1U << AFEC_CHSR_CH8_Pos)                    /**< (AFEC_CHSR) Channel 8 Status Mask */
#define AFEC_CHSR_CH9_Pos                     (9)                                            /**< (AFEC_CHSR) Channel 9 Status Position */
#define AFEC_CHSR_CH9_Msk                     (0x1U << AFEC_CHSR_CH9_Pos)                    /**< (AFEC_CHSR) Channel 9 Status Mask */
#define AFEC_CHSR_CH10_Pos                    (10)                                           /**< (AFEC_CHSR) Channel 10 Status Position */
#define AFEC_CHSR_CH10_Msk                    (0x1U << AFEC_CHSR_CH10_Pos)                   /**< (AFEC_CHSR) Channel 10 Status Mask */
#define AFEC_CHSR_CH11_Pos                    (11)                                           /**< (AFEC_CHSR) Channel 11 Status Position */
#define AFEC_CHSR_CH11_Msk                    (0x1U << AFEC_CHSR_CH11_Pos)                   /**< (AFEC_CHSR) Channel 11 Status Mask */
#define AFEC_CHSR_Msk                         (0x00000FFFUL)                                 /**< (AFEC_CHSR) Register Mask  */
#define AFEC_CHSR_CH_Pos                      (0)                                            /**< (AFEC_CHSR Position) Channel xx Status */
#define AFEC_CHSR_CH_Msk                      (0xFFFU << AFEC_CHSR_CH_Pos)                   /**< (AFEC_CHSR Mask) CH */
#define AFEC_CHSR_CH(value)                   (AFEC_CHSR_CH_Msk & ((value) << AFEC_CHSR_CH_Pos))

/* -------- AFEC_LCDR : (AFEC Offset: 0x20) (R/ 32) AFEC Last Converted Data Register -------- */

typedef union
{
  struct
  {
    uint32_t LDATA:16;                  /**< bit:  0..15  Last Data Converted                           */
    uint32_t :8;                        /**< bit: 16..23  Reserved                                      */
    uint32_t CHNB:4;                    /**< bit: 24..27  Channel Number                                */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_LCDR_bits_t;

#define AFEC_LCDR_LDATA_Pos                   (0)                                            /**< (AFEC_LCDR) Last Data Converted Position */
#define AFEC_LCDR_LDATA_Msk                   (0xFFFFU << AFEC_LCDR_LDATA_Pos)               /**< (AFEC_LCDR) Last Data Converted Mask */
#define AFEC_LCDR_LDATA(value)                (AFEC_LCDR_LDATA_Msk & ((value) << AFEC_LCDR_LDATA_Pos))
#define AFEC_LCDR_CHNB_Pos                    (24)                                           /**< (AFEC_LCDR) Channel Number Position */
#define AFEC_LCDR_CHNB_Msk                    (0xFU << AFEC_LCDR_CHNB_Pos)                   /**< (AFEC_LCDR) Channel Number Mask */
#define AFEC_LCDR_CHNB(value)                 (AFEC_LCDR_CHNB_Msk & ((value) << AFEC_LCDR_CHNB_Pos))
#define AFEC_LCDR_Msk                         (0x0F00FFFFUL)                                 /**< (AFEC_LCDR) Register Mask  */

