zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
/* -------- AFEC_IER : (AFEC Offset: 0x24) (/W 32) AFEC Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Enable 0          */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Enable 1          */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Enable 2          */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Enable 3          */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Enable 4          */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Enable 5          */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Enable 6          */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Enable 7          */
    uint32_t EOC8:1;                    /**< bit:      8  End of Conversion Interrupt Enable 8          */
    uint32_t EOC9:1;                    /**< bit:      9  End of Conversion Interrupt Enable 9          */
    uint32_t EOC10:1;                   /**< bit:     10  End of Conversion Interrupt Enable 10         */
    uint32_t EOC11:1;                   /**< bit:     11  End of Conversion Interrupt Enable 11         */
    uint32_t :12;                       /**< bit: 12..23  Reserved                                      */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Enable                   */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Enable        */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Enable             */
    uint32_t :3;                        /**< bit: 27..29  Reserved                                      */
    uint32_t TEMPCHG:1;                 /**< bit:     30  Temperature Change Interrupt Enable           */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  struct
  {
    uint32_t EOC:12;                    /**< bit:  0..11  End of Conversion Interrupt Enable x          */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_IER_bits_t;

#define AFEC_IER_EOC0_Pos                     (0)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 0 Position */
#define AFEC_IER_EOC0_Msk                     (0x1U << AFEC_IER_EOC0_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 0 Mask */
#define AFEC_IER_EOC1_Pos                     (1)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 1 Position */
#define AFEC_IER_EOC1_Msk                     (0x1U << AFEC_IER_EOC1_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 1 Mask */
#define AFEC_IER_EOC2_Pos                     (2)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 2 Position */
#define AFEC_IER_EOC2_Msk                     (0x1U << AFEC_IER_EOC2_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 2 Mask */
#define AFEC_IER_EOC3_Pos                     (3)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 3 Position */
#define AFEC_IER_EOC3_Msk                     (0x1U << AFEC_IER_EOC3_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 3 Mask */
#define AFEC_IER_EOC4_Pos                     (4)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 4 Position */
#define AFEC_IER_EOC4_Msk                     (0x1U << AFEC_IER_EOC4_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 4 Mask */
#define AFEC_IER_EOC5_Pos                     (5)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 5 Position */
#define AFEC_IER_EOC5_Msk                     (0x1U << AFEC_IER_EOC5_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 5 Mask */
#define AFEC_IER_EOC6_Pos                     (6)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 6 Position */
#define AFEC_IER_EOC6_Msk                     (0x1U << AFEC_IER_EOC6_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 6 Mask */
#define AFEC_IER_EOC7_Pos                     (7)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 7 Position */
#define AFEC_IER_EOC7_Msk                     (0x1U << AFEC_IER_EOC7_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 7 Mask */
#define AFEC_IER_EOC8_Pos                     (8)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 8 Position */
#define AFEC_IER_EOC8_Msk                     (0x1U << AFEC_IER_EOC8_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 8 Mask */
#define AFEC_IER_EOC9_Pos                     (9)                                            /**< (AFEC_IER) End of Conversion Interrupt Enable 9 Position */
#define AFEC_IER_EOC9_Msk                     (0x1U << AFEC_IER_EOC9_Pos)                    /**< (AFEC_IER) End of Conversion Interrupt Enable 9 Mask */
#define AFEC_IER_EOC10_Pos                    (10)                                           /**< (AFEC_IER) End of Conversion Interrupt Enable 10 Position */
#define AFEC_IER_EOC10_Msk                    (0x1U << AFEC_IER_EOC10_Pos)                   /**< (AFEC_IER) End of Conversion Interrupt Enable 10 Mask */
#define AFEC_IER_EOC11_Pos                    (11)                                           /**< (AFEC_IER) End of Conversion Interrupt Enable 11 Position */
#define AFEC_IER_EOC11_Msk                    (0x1U << AFEC_IER_EOC11_Pos)                   /**< (AFEC_IER) End of Conversion Interrupt Enable 11 Mask */
#define AFEC_IER_DRDY_Pos                     (24)                                           /**< (AFEC_IER) Data Ready Interrupt Enable Position */
#define AFEC_IER_DRDY_Msk                     (0x1U << AFEC_IER_DRDY_Pos)                    /**< (AFEC_IER) Data Ready Interrupt Enable Mask */
#define AFEC_IER_GOVRE_Pos                    (25)                                           /**< (AFEC_IER) General Overrun Error Interrupt Enable Position */
#define AFEC_IER_GOVRE_Msk                    (0x1U << AFEC_IER_GOVRE_Pos)                   /**< (AFEC_IER) General Overrun Error Interrupt Enable Mask */
#define AFEC_IER_COMPE_Pos                    (26)                                           /**< (AFEC_IER) Comparison Event Interrupt Enable Position */
#define AFEC_IER_COMPE_Msk                    (0x1U << AFEC_IER_COMPE_Pos)                   /**< (AFEC_IER) Comparison Event Interrupt Enable Mask */
#define AFEC_IER_TEMPCHG_Pos                  (30)                                           /**< (AFEC_IER) Temperature Change Interrupt Enable Position */
#define AFEC_IER_TEMPCHG_Msk                  (0x1U << AFEC_IER_TEMPCHG_Pos)                 /**< (AFEC_IER) Temperature Change Interrupt Enable Mask */
#define AFEC_IER_Msk                          (0x47000FFFUL)                                 /**< (AFEC_IER) Register Mask  */
#define AFEC_IER_EOC_Pos                      (0)                                            /**< (AFEC_IER Position) End of Conversion Interrupt Enable x */
#define AFEC_IER_EOC_Msk                      (0xFFFU << AFEC_IER_EOC_Pos)                   /**< (AFEC_IER Mask) EOC */
#define AFEC_IER_EOC(value)                   (AFEC_IER_EOC_Msk & ((value) << AFEC_IER_EOC_Pos))

/* -------- AFEC_IDR : (AFEC Offset: 0x28) (/W 32) AFEC Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Disable 0         */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Disable 1         */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Disable 2         */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Disable 3         */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Disable 4         */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Disable 5         */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Disable 6         */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Disable 7         */
    uint32_t EOC8:1;                    /**< bit:      8  End of Conversion Interrupt Disable 8         */
    uint32_t EOC9:1;                    /**< bit:      9  End of Conversion Interrupt Disable 9         */
    uint32_t EOC10:1;                   /**< bit:     10  End of Conversion Interrupt Disable 10        */
    uint32_t EOC11:1;                   /**< bit:     11  End of Conversion Interrupt Disable 11        */
    uint32_t :12;                       /**< bit: 12..23  Reserved                                      */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Disable                  */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Disable       */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Disable            */
    uint32_t :3;                        /**< bit: 27..29  Reserved                                      */
    uint32_t TEMPCHG:1;                 /**< bit:     30  Temperature Change Interrupt Disable          */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  struct
  {
    uint32_t EOC:12;                    /**< bit:  0..11  End of Conversion Interrupt Disable x         */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_IDR_bits_t;

