zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
#define AFEC_IDR_EOC0_Pos                     (0)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 0 Position */
#define AFEC_IDR_EOC0_Msk                     (0x1U << AFEC_IDR_EOC0_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define AFEC_IDR_EOC1_Pos                     (1)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 1 Position */
#define AFEC_IDR_EOC1_Msk                     (0x1U << AFEC_IDR_EOC1_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define AFEC_IDR_EOC2_Pos                     (2)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 2 Position */
#define AFEC_IDR_EOC2_Msk                     (0x1U << AFEC_IDR_EOC2_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define AFEC_IDR_EOC3_Pos                     (3)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 3 Position */
#define AFEC_IDR_EOC3_Msk                     (0x1U << AFEC_IDR_EOC3_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define AFEC_IDR_EOC4_Pos                     (4)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 4 Position */
#define AFEC_IDR_EOC4_Msk                     (0x1U << AFEC_IDR_EOC4_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define AFEC_IDR_EOC5_Pos                     (5)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 5 Position */
#define AFEC_IDR_EOC5_Msk                     (0x1U << AFEC_IDR_EOC5_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define AFEC_IDR_EOC6_Pos                     (6)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 6 Position */
#define AFEC_IDR_EOC6_Msk                     (0x1U << AFEC_IDR_EOC6_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define AFEC_IDR_EOC7_Pos                     (7)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 7 Position */
#define AFEC_IDR_EOC7_Msk                     (0x1U << AFEC_IDR_EOC7_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define AFEC_IDR_EOC8_Pos                     (8)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 8 Position */
#define AFEC_IDR_EOC8_Msk                     (0x1U << AFEC_IDR_EOC8_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 8 Mask */
#define AFEC_IDR_EOC9_Pos                     (9)                                            /**< (AFEC_IDR) End of Conversion Interrupt Disable 9 Position */
#define AFEC_IDR_EOC9_Msk                     (0x1U << AFEC_IDR_EOC9_Pos)                    /**< (AFEC_IDR) End of Conversion Interrupt Disable 9 Mask */
#define AFEC_IDR_EOC10_Pos                    (10)                                           /**< (AFEC_IDR) End of Conversion Interrupt Disable 10 Position */
#define AFEC_IDR_EOC10_Msk                    (0x1U << AFEC_IDR_EOC10_Pos)                   /**< (AFEC_IDR) End of Conversion Interrupt Disable 10 Mask */
#define AFEC_IDR_EOC11_Pos                    (11)                                           /**< (AFEC_IDR) End of Conversion Interrupt Disable 11 Position */
#define AFEC_IDR_EOC11_Msk                    (0x1U << AFEC_IDR_EOC11_Pos)                   /**< (AFEC_IDR) End of Conversion Interrupt Disable 11 Mask */
#define AFEC_IDR_DRDY_Pos                     (24)                                           /**< (AFEC_IDR) Data Ready Interrupt Disable Position */
#define AFEC_IDR_DRDY_Msk                     (0x1U << AFEC_IDR_DRDY_Pos)                    /**< (AFEC_IDR) Data Ready Interrupt Disable Mask */
#define AFEC_IDR_GOVRE_Pos                    (25)                                           /**< (AFEC_IDR) General Overrun Error Interrupt Disable Position */
#define AFEC_IDR_GOVRE_Msk                    (0x1U << AFEC_IDR_GOVRE_Pos)                   /**< (AFEC_IDR) General Overrun Error Interrupt Disable Mask */
#define AFEC_IDR_COMPE_Pos                    (26)                                           /**< (AFEC_IDR) Comparison Event Interrupt Disable Position */
#define AFEC_IDR_COMPE_Msk                    (0x1U << AFEC_IDR_COMPE_Pos)                   /**< (AFEC_IDR) Comparison Event Interrupt Disable Mask */
#define AFEC_IDR_TEMPCHG_Pos                  (30)                                           /**< (AFEC_IDR) Temperature Change Interrupt Disable Position */
#define AFEC_IDR_TEMPCHG_Msk                  (0x1U << AFEC_IDR_TEMPCHG_Pos)                 /**< (AFEC_IDR) Temperature Change Interrupt Disable Mask */
#define AFEC_IDR_Msk                          (0x47000FFFUL)                                 /**< (AFEC_IDR) Register Mask  */
#define AFEC_IDR_EOC_Pos                      (0)                                            /**< (AFEC_IDR Position) End of Conversion Interrupt Disable x */
#define AFEC_IDR_EOC_Msk                      (0xFFFU << AFEC_IDR_EOC_Pos)                   /**< (AFEC_IDR Mask) EOC */
#define AFEC_IDR_EOC(value)                   (AFEC_IDR_EOC_Msk & ((value) << AFEC_IDR_EOC_Pos))

/* -------- AFEC_IMR : (AFEC Offset: 0x2c) (R/ 32) AFEC Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion Interrupt Mask 0            */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion Interrupt Mask 1            */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion Interrupt Mask 2            */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion Interrupt Mask 3            */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion Interrupt Mask 4            */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion Interrupt Mask 5            */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion Interrupt Mask 6            */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion Interrupt Mask 7            */
    uint32_t EOC8:1;                    /**< bit:      8  End of Conversion Interrupt Mask 8            */
    uint32_t EOC9:1;                    /**< bit:      9  End of Conversion Interrupt Mask 9            */
    uint32_t EOC10:1;                   /**< bit:     10  End of Conversion Interrupt Mask 10           */
    uint32_t EOC11:1;                   /**< bit:     11  End of Conversion Interrupt Mask 11           */
    uint32_t :12;                       /**< bit: 12..23  Reserved                                      */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready Interrupt Mask                     */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error Interrupt Mask          */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Event Interrupt Mask               */
    uint32_t :3;                        /**< bit: 27..29  Reserved                                      */
    uint32_t TEMPCHG:1;                 /**< bit:     30  Temperature Change Interrupt Mask             */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  struct
  {
    uint32_t EOC:12;                    /**< bit:  0..11  End of Conversion Interrupt Mask x            */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_IMR_bits_t;

#define AFEC_IMR_EOC0_Pos                     (0)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 0 Position */
#define AFEC_IMR_EOC0_Msk                     (0x1U << AFEC_IMR_EOC0_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 0 Mask */
#define AFEC_IMR_EOC1_Pos                     (1)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 1 Position */
#define AFEC_IMR_EOC1_Msk                     (0x1U << AFEC_IMR_EOC1_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 1 Mask */
#define AFEC_IMR_EOC2_Pos                     (2)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 2 Position */
#define AFEC_IMR_EOC2_Msk                     (0x1U << AFEC_IMR_EOC2_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 2 Mask */
#define AFEC_IMR_EOC3_Pos                     (3)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 3 Position */
#define AFEC_IMR_EOC3_Msk                     (0x1U << AFEC_IMR_EOC3_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 3 Mask */
#define AFEC_IMR_EOC4_Pos                     (4)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 4 Position */
#define AFEC_IMR_EOC4_Msk                     (0x1U << AFEC_IMR_EOC4_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 4 Mask */
#define AFEC_IMR_EOC5_Pos                     (5)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 5 Position */
#define AFEC_IMR_EOC5_Msk                     (0x1U << AFEC_IMR_EOC5_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 5 Mask */
#define AFEC_IMR_EOC6_Pos                     (6)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 6 Position */
#define AFEC_IMR_EOC6_Msk                     (0x1U << AFEC_IMR_EOC6_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 6 Mask */
#define AFEC_IMR_EOC7_Pos                     (7)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 7 Position */
#define AFEC_IMR_EOC7_Msk                     (0x1U << AFEC_IMR_EOC7_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 7 Mask */
#define AFEC_IMR_EOC8_Pos                     (8)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 8 Position */
#define AFEC_IMR_EOC8_Msk                     (0x1U << AFEC_IMR_EOC8_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 8 Mask */
#define AFEC_IMR_EOC9_Pos                     (9)                                            /**< (AFEC_IMR) End of Conversion Interrupt Mask 9 Position */
#define AFEC_IMR_EOC9_Msk                     (0x1U << AFEC_IMR_EOC9_Pos)                    /**< (AFEC_IMR) End of Conversion Interrupt Mask 9 Mask */
#define AFEC_IMR_EOC10_Pos                    (10)                                           /**< (AFEC_IMR) End of Conversion Interrupt Mask 10 Position */
#define AFEC_IMR_EOC10_Msk                    (0x1U << AFEC_IMR_EOC10_Pos)                   /**< (AFEC_IMR) End of Conversion Interrupt Mask 10 Mask */
#define AFEC_IMR_EOC11_Pos                    (11)                                           /**< (AFEC_IMR) End of Conversion Interrupt Mask 11 Position */
#define AFEC_IMR_EOC11_Msk                    (0x1U << AFEC_IMR_EOC11_Pos)                   /**< (AFEC_IMR) End of Conversion Interrupt Mask 11 Mask */
#define AFEC_IMR_DRDY_Pos                     (24)                                           /**< (AFEC_IMR) Data Ready Interrupt Mask Position */
#define AFEC_IMR_DRDY_Msk                     (0x1U << AFEC_IMR_DRDY_Pos)                    /**< (AFEC_IMR) Data Ready Interrupt Mask Mask */
#define AFEC_IMR_GOVRE_Pos                    (25)                                           /**< (AFEC_IMR) General Overrun Error Interrupt Mask Position */
#define AFEC_IMR_GOVRE_Msk                    (0x1U << AFEC_IMR_GOVRE_Pos)                   /**< (AFEC_IMR) General Overrun Error Interrupt Mask Mask */
#define AFEC_IMR_COMPE_Pos                    (26)                                           /**< (AFEC_IMR) Comparison Event Interrupt Mask Position */
#define AFEC_IMR_COMPE_Msk                    (0x1U << AFEC_IMR_COMPE_Pos)                   /**< (AFEC_IMR) Comparison Event Interrupt Mask Mask */
#define AFEC_IMR_TEMPCHG_Pos                  (30)                                           /**< (AFEC_IMR) Temperature Change Interrupt Mask Position */
#define AFEC_IMR_TEMPCHG_Msk                  (0x1U << AFEC_IMR_TEMPCHG_Pos)                 /**< (AFEC_IMR) Temperature Change Interrupt Mask Mask */
#define AFEC_IMR_Msk                          (0x47000FFFUL)                                 /**< (AFEC_IMR) Register Mask  */
#define AFEC_IMR_EOC_Pos                      (0)                                            /**< (AFEC_IMR Position) End of Conversion Interrupt Mask x */
#define AFEC_IMR_EOC_Msk                      (0xFFFU << AFEC_IMR_EOC_Pos)                   /**< (AFEC_IMR Mask) EOC */
#define AFEC_IMR_EOC(value)                   (AFEC_IMR_EOC_Msk & ((value) << AFEC_IMR_EOC_Pos))

/* -------- AFEC_ISR : (AFEC Offset: 0x30) (R/ 32) AFEC Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t EOC0:1;                    /**< bit:      0  End of Conversion 0 (cleared by reading AFEC_CDRx) */
    uint32_t EOC1:1;                    /**< bit:      1  End of Conversion 1 (cleared by reading AFEC_CDRx) */
    uint32_t EOC2:1;                    /**< bit:      2  End of Conversion 2 (cleared by reading AFEC_CDRx) */
    uint32_t EOC3:1;                    /**< bit:      3  End of Conversion 3 (cleared by reading AFEC_CDRx) */
    uint32_t EOC4:1;                    /**< bit:      4  End of Conversion 4 (cleared by reading AFEC_CDRx) */
    uint32_t EOC5:1;                    /**< bit:      5  End of Conversion 5 (cleared by reading AFEC_CDRx) */
    uint32_t EOC6:1;                    /**< bit:      6  End of Conversion 6 (cleared by reading AFEC_CDRx) */
    uint32_t EOC7:1;                    /**< bit:      7  End of Conversion 7 (cleared by reading AFEC_CDRx) */
    uint32_t EOC8:1;                    /**< bit:      8  End of Conversion 8 (cleared by reading AFEC_CDRx) */
    uint32_t EOC9:1;                    /**< bit:      9  End of Conversion 9 (cleared by reading AFEC_CDRx) */
    uint32_t EOC10:1;                   /**< bit:     10  End of Conversion 10 (cleared by reading AFEC_CDRx) */
    uint32_t EOC11:1;                   /**< bit:     11  End of Conversion 11 (cleared by reading AFEC_CDRx) */
    uint32_t :12;                       /**< bit: 12..23  Reserved                                      */
    uint32_t DRDY:1;                    /**< bit:     24  Data Ready (cleared by reading AFEC_LCDR)     */
    uint32_t GOVRE:1;                   /**< bit:     25  General Overrun Error (cleared by reading AFEC_ISR) */
    uint32_t COMPE:1;                   /**< bit:     26  Comparison Error (cleared by reading AFEC_ISR) */
    uint32_t :3;                        /**< bit: 27..29  Reserved                                      */
    uint32_t TEMPCHG:1;                 /**< bit:     30  Temperature Change (cleared on read)          */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  struct
  {
    uint32_t EOC:12;                    /**< bit:  0..11  End of Conversion x (cleared by reading AFEC_CDRx) */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_ISR_bits_t;

