zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
#define AFEC_ISR_EOC0_Pos                     (0)                                            /**< (AFEC_ISR) End of Conversion 0 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC0_Msk                     (0x1U << AFEC_ISR_EOC0_Pos)                    /**< (AFEC_ISR) End of Conversion 0 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC1_Pos                     (1)                                            /**< (AFEC_ISR) End of Conversion 1 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC1_Msk                     (0x1U << AFEC_ISR_EOC1_Pos)                    /**< (AFEC_ISR) End of Conversion 1 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC2_Pos                     (2)                                            /**< (AFEC_ISR) End of Conversion 2 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC2_Msk                     (0x1U << AFEC_ISR_EOC2_Pos)                    /**< (AFEC_ISR) End of Conversion 2 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC3_Pos                     (3)                                            /**< (AFEC_ISR) End of Conversion 3 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC3_Msk                     (0x1U << AFEC_ISR_EOC3_Pos)                    /**< (AFEC_ISR) End of Conversion 3 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC4_Pos                     (4)                                            /**< (AFEC_ISR) End of Conversion 4 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC4_Msk                     (0x1U << AFEC_ISR_EOC4_Pos)                    /**< (AFEC_ISR) End of Conversion 4 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC5_Pos                     (5)                                            /**< (AFEC_ISR) End of Conversion 5 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC5_Msk                     (0x1U << AFEC_ISR_EOC5_Pos)                    /**< (AFEC_ISR) End of Conversion 5 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC6_Pos                     (6)                                            /**< (AFEC_ISR) End of Conversion 6 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC6_Msk                     (0x1U << AFEC_ISR_EOC6_Pos)                    /**< (AFEC_ISR) End of Conversion 6 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC7_Pos                     (7)                                            /**< (AFEC_ISR) End of Conversion 7 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC7_Msk                     (0x1U << AFEC_ISR_EOC7_Pos)                    /**< (AFEC_ISR) End of Conversion 7 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC8_Pos                     (8)                                            /**< (AFEC_ISR) End of Conversion 8 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC8_Msk                     (0x1U << AFEC_ISR_EOC8_Pos)                    /**< (AFEC_ISR) End of Conversion 8 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC9_Pos                     (9)                                            /**< (AFEC_ISR) End of Conversion 9 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC9_Msk                     (0x1U << AFEC_ISR_EOC9_Pos)                    /**< (AFEC_ISR) End of Conversion 9 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC10_Pos                    (10)                                           /**< (AFEC_ISR) End of Conversion 10 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC10_Msk                    (0x1U << AFEC_ISR_EOC10_Pos)                   /**< (AFEC_ISR) End of Conversion 10 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC11_Pos                    (11)                                           /**< (AFEC_ISR) End of Conversion 11 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC11_Msk                    (0x1U << AFEC_ISR_EOC11_Pos)                   /**< (AFEC_ISR) End of Conversion 11 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_DRDY_Pos                     (24)                                           /**< (AFEC_ISR) Data Ready (cleared by reading AFEC_LCDR) Position */
#define AFEC_ISR_DRDY_Msk                     (0x1U << AFEC_ISR_DRDY_Pos)                    /**< (AFEC_ISR) Data Ready (cleared by reading AFEC_LCDR) Mask */
#define AFEC_ISR_GOVRE_Pos                    (25)                                           /**< (AFEC_ISR) General Overrun Error (cleared by reading AFEC_ISR) Position */
#define AFEC_ISR_GOVRE_Msk                    (0x1U << AFEC_ISR_GOVRE_Pos)                   /**< (AFEC_ISR) General Overrun Error (cleared by reading AFEC_ISR) Mask */
#define AFEC_ISR_COMPE_Pos                    (26)                                           /**< (AFEC_ISR) Comparison Error (cleared by reading AFEC_ISR) Position */
#define AFEC_ISR_COMPE_Msk                    (0x1U << AFEC_ISR_COMPE_Pos)                   /**< (AFEC_ISR) Comparison Error (cleared by reading AFEC_ISR) Mask */
#define AFEC_ISR_TEMPCHG_Pos                  (30)                                           /**< (AFEC_ISR) Temperature Change (cleared on read) Position */
#define AFEC_ISR_TEMPCHG_Msk                  (0x1U << AFEC_ISR_TEMPCHG_Pos)                 /**< (AFEC_ISR) Temperature Change (cleared on read) Mask */
#define AFEC_ISR_Msk                          (0x47000FFFUL)                                 /**< (AFEC_ISR) Register Mask  */
#define AFEC_ISR_EOC_Pos                      (0)                                            /**< (AFEC_ISR Position) End of Conversion x (cleared by reading AFEC_CDRx) */
#define AFEC_ISR_EOC_Msk                      (0xFFFU << AFEC_ISR_EOC_Pos)                   /**< (AFEC_ISR Mask) EOC */
#define AFEC_ISR_EOC(value)                   (AFEC_ISR_EOC_Msk & ((value) << AFEC_ISR_EOC_Pos))

/* -------- AFEC_OVER : (AFEC Offset: 0x4c) (R/ 32) AFEC Overrun Status Register -------- */

typedef union
{
  struct
  {
    uint32_t OVRE0:1;                   /**< bit:      0  Overrun Error 0                               */
    uint32_t OVRE1:1;                   /**< bit:      1  Overrun Error 1                               */
    uint32_t OVRE2:1;                   /**< bit:      2  Overrun Error 2                               */
    uint32_t OVRE3:1;                   /**< bit:      3  Overrun Error 3                               */
    uint32_t OVRE4:1;                   /**< bit:      4  Overrun Error 4                               */
    uint32_t OVRE5:1;                   /**< bit:      5  Overrun Error 5                               */
    uint32_t OVRE6:1;                   /**< bit:      6  Overrun Error 6                               */
    uint32_t OVRE7:1;                   /**< bit:      7  Overrun Error 7                               */
    uint32_t OVRE8:1;                   /**< bit:      8  Overrun Error 8                               */
    uint32_t OVRE9:1;                   /**< bit:      9  Overrun Error 9                               */
    uint32_t OVRE10:1;                  /**< bit:     10  Overrun Error 10                              */
    uint32_t OVRE11:1;                  /**< bit:     11  Overrun Error 11                              */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t OVRE:12;                   /**< bit:  0..11  Overrun Error xx                              */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_OVER_bits_t;

