zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
#define AFEC_OVER_OVRE0_Pos                   (0)                                            /**< (AFEC_OVER) Overrun Error 0 Position */
#define AFEC_OVER_OVRE0_Msk                   (0x1U << AFEC_OVER_OVRE0_Pos)                  /**< (AFEC_OVER) Overrun Error 0 Mask */
#define AFEC_OVER_OVRE1_Pos                   (1)                                            /**< (AFEC_OVER) Overrun Error 1 Position */
#define AFEC_OVER_OVRE1_Msk                   (0x1U << AFEC_OVER_OVRE1_Pos)                  /**< (AFEC_OVER) Overrun Error 1 Mask */
#define AFEC_OVER_OVRE2_Pos                   (2)                                            /**< (AFEC_OVER) Overrun Error 2 Position */
#define AFEC_OVER_OVRE2_Msk                   (0x1U << AFEC_OVER_OVRE2_Pos)                  /**< (AFEC_OVER) Overrun Error 2 Mask */
#define AFEC_OVER_OVRE3_Pos                   (3)                                            /**< (AFEC_OVER) Overrun Error 3 Position */
#define AFEC_OVER_OVRE3_Msk                   (0x1U << AFEC_OVER_OVRE3_Pos)                  /**< (AFEC_OVER) Overrun Error 3 Mask */
#define AFEC_OVER_OVRE4_Pos                   (4)                                            /**< (AFEC_OVER) Overrun Error 4 Position */
#define AFEC_OVER_OVRE4_Msk                   (0x1U << AFEC_OVER_OVRE4_Pos)                  /**< (AFEC_OVER) Overrun Error 4 Mask */
#define AFEC_OVER_OVRE5_Pos                   (5)                                            /**< (AFEC_OVER) Overrun Error 5 Position */
#define AFEC_OVER_OVRE5_Msk                   (0x1U << AFEC_OVER_OVRE5_Pos)                  /**< (AFEC_OVER) Overrun Error 5 Mask */
#define AFEC_OVER_OVRE6_Pos                   (6)                                            /**< (AFEC_OVER) Overrun Error 6 Position */
#define AFEC_OVER_OVRE6_Msk                   (0x1U << AFEC_OVER_OVRE6_Pos)                  /**< (AFEC_OVER) Overrun Error 6 Mask */
#define AFEC_OVER_OVRE7_Pos                   (7)                                            /**< (AFEC_OVER) Overrun Error 7 Position */
#define AFEC_OVER_OVRE7_Msk                   (0x1U << AFEC_OVER_OVRE7_Pos)                  /**< (AFEC_OVER) Overrun Error 7 Mask */
#define AFEC_OVER_OVRE8_Pos                   (8)                                            /**< (AFEC_OVER) Overrun Error 8 Position */
#define AFEC_OVER_OVRE8_Msk                   (0x1U << AFEC_OVER_OVRE8_Pos)                  /**< (AFEC_OVER) Overrun Error 8 Mask */
#define AFEC_OVER_OVRE9_Pos                   (9)                                            /**< (AFEC_OVER) Overrun Error 9 Position */
#define AFEC_OVER_OVRE9_Msk                   (0x1U << AFEC_OVER_OVRE9_Pos)                  /**< (AFEC_OVER) Overrun Error 9 Mask */
#define AFEC_OVER_OVRE10_Pos                  (10)                                           /**< (AFEC_OVER) Overrun Error 10 Position */
#define AFEC_OVER_OVRE10_Msk                  (0x1U << AFEC_OVER_OVRE10_Pos)                 /**< (AFEC_OVER) Overrun Error 10 Mask */
#define AFEC_OVER_OVRE11_Pos                  (11)                                           /**< (AFEC_OVER) Overrun Error 11 Position */
#define AFEC_OVER_OVRE11_Msk                  (0x1U << AFEC_OVER_OVRE11_Pos)                 /**< (AFEC_OVER) Overrun Error 11 Mask */
#define AFEC_OVER_Msk                         (0x00000FFFUL)                                 /**< (AFEC_OVER) Register Mask  */
#define AFEC_OVER_OVRE_Pos                    (0)                                            /**< (AFEC_OVER Position) Overrun Error xx */
#define AFEC_OVER_OVRE_Msk                    (0xFFFU << AFEC_OVER_OVRE_Pos)                 /**< (AFEC_OVER Mask) OVRE */
#define AFEC_OVER_OVRE(value)                 (AFEC_OVER_OVRE_Msk & ((value) << AFEC_OVER_OVRE_Pos))

/* -------- AFEC_CWR : (AFEC Offset: 0x50) (R/W 32) AFEC Compare Window Register -------- */

typedef union
{
  struct
  {
    uint32_t LOWTHRES:16;               /**< bit:  0..15  Low Threshold                                 */
    uint32_t HIGHTHRES:16;              /**< bit: 16..31  High Threshold                                */
  };
  uint32_t w;
} __AFEC_CWR_bits_t;

#define AFEC_CWR_LOWTHRES_Pos                 (0)                                            /**< (AFEC_CWR) Low Threshold Position */
#define AFEC_CWR_LOWTHRES_Msk                 (0xFFFFU << AFEC_CWR_LOWTHRES_Pos)             /**< (AFEC_CWR) Low Threshold Mask */
#define AFEC_CWR_LOWTHRES(value)              (AFEC_CWR_LOWTHRES_Msk & ((value) << AFEC_CWR_LOWTHRES_Pos))
#define AFEC_CWR_HIGHTHRES_Pos                (16)                                           /**< (AFEC_CWR) High Threshold Position */
#define AFEC_CWR_HIGHTHRES_Msk                (0xFFFFU << AFEC_CWR_HIGHTHRES_Pos)            /**< (AFEC_CWR) High Threshold Mask */
#define AFEC_CWR_HIGHTHRES(value)             (AFEC_CWR_HIGHTHRES_Msk & ((value) << AFEC_CWR_HIGHTHRES_Pos))
#define AFEC_CWR_Msk                          (0xFFFFFFFFUL)                                 /**< (AFEC_CWR) Register Mask  */

/* -------- AFEC_CGR : (AFEC Offset: 0x54) (R/W 32) AFEC Channel Gain Register -------- */

typedef union
{
  struct
  {
    uint32_t GAIN0:2;                   /**< bit:   0..1  Gain for Channel 0                            */
    uint32_t GAIN1:2;                   /**< bit:   2..3  Gain for Channel 1                            */
    uint32_t GAIN2:2;                   /**< bit:   4..5  Gain for Channel 2                            */
    uint32_t GAIN3:2;                   /**< bit:   6..7  Gain for Channel 3                            */
    uint32_t GAIN4:2;                   /**< bit:   8..9  Gain for Channel 4                            */
    uint32_t GAIN5:2;                   /**< bit: 10..11  Gain for Channel 5                            */
    uint32_t GAIN6:2;                   /**< bit: 12..13  Gain for Channel 6                            */
    uint32_t GAIN7:2;                   /**< bit: 14..15  Gain for Channel 7                            */
    uint32_t GAIN8:2;                   /**< bit: 16..17  Gain for Channel 8                            */
    uint32_t GAIN9:2;                   /**< bit: 18..19  Gain for Channel 9                            */
    uint32_t GAIN10:2;                  /**< bit: 20..21  Gain for Channel 10                           */
    uint32_t GAIN11:2;                  /**< bit: 22..23  Gain for Channel 11                           */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CGR_bits_t;

#define AFEC_CGR_GAIN0_Pos                    (0)                                            /**< (AFEC_CGR) Gain for Channel 0 Position */
#define AFEC_CGR_GAIN0_Msk                    (0x3U << AFEC_CGR_GAIN0_Pos)                   /**< (AFEC_CGR) Gain for Channel 0 Mask */
#define AFEC_CGR_GAIN0(value)                 (AFEC_CGR_GAIN0_Msk & ((value) << AFEC_CGR_GAIN0_Pos))
#define AFEC_CGR_GAIN1_Pos                    (2)                                            /**< (AFEC_CGR) Gain for Channel 1 Position */
#define AFEC_CGR_GAIN1_Msk                    (0x3U << AFEC_CGR_GAIN1_Pos)                   /**< (AFEC_CGR) Gain for Channel 1 Mask */
#define AFEC_CGR_GAIN1(value)                 (AFEC_CGR_GAIN1_Msk & ((value) << AFEC_CGR_GAIN1_Pos))
#define AFEC_CGR_GAIN2_Pos                    (4)                                            /**< (AFEC_CGR) Gain for Channel 2 Position */
#define AFEC_CGR_GAIN2_Msk                    (0x3U << AFEC_CGR_GAIN2_Pos)                   /**< (AFEC_CGR) Gain for Channel 2 Mask */
#define AFEC_CGR_GAIN2(value)                 (AFEC_CGR_GAIN2_Msk & ((value) << AFEC_CGR_GAIN2_Pos))
#define AFEC_CGR_GAIN3_Pos                    (6)                                            /**< (AFEC_CGR) Gain for Channel 3 Position */
#define AFEC_CGR_GAIN3_Msk                    (0x3U << AFEC_CGR_GAIN3_Pos)                   /**< (AFEC_CGR) Gain for Channel 3 Mask */
#define AFEC_CGR_GAIN3(value)                 (AFEC_CGR_GAIN3_Msk & ((value) << AFEC_CGR_GAIN3_Pos))
#define AFEC_CGR_GAIN4_Pos                    (8)                                            /**< (AFEC_CGR) Gain for Channel 4 Position */
#define AFEC_CGR_GAIN4_Msk                    (0x3U << AFEC_CGR_GAIN4_Pos)                   /**< (AFEC_CGR) Gain for Channel 4 Mask */
#define AFEC_CGR_GAIN4(value)                 (AFEC_CGR_GAIN4_Msk & ((value) << AFEC_CGR_GAIN4_Pos))
#define AFEC_CGR_GAIN5_Pos                    (10)                                           /**< (AFEC_CGR) Gain for Channel 5 Position */
#define AFEC_CGR_GAIN5_Msk                    (0x3U << AFEC_CGR_GAIN5_Pos)                   /**< (AFEC_CGR) Gain for Channel 5 Mask */
#define AFEC_CGR_GAIN5(value)                 (AFEC_CGR_GAIN5_Msk & ((value) << AFEC_CGR_GAIN5_Pos))
#define AFEC_CGR_GAIN6_Pos                    (12)                                           /**< (AFEC_CGR) Gain for Channel 6 Position */
#define AFEC_CGR_GAIN6_Msk                    (0x3U << AFEC_CGR_GAIN6_Pos)                   /**< (AFEC_CGR) Gain for Channel 6 Mask */
#define AFEC_CGR_GAIN6(value)                 (AFEC_CGR_GAIN6_Msk & ((value) << AFEC_CGR_GAIN6_Pos))
#define AFEC_CGR_GAIN7_Pos                    (14)                                           /**< (AFEC_CGR) Gain for Channel 7 Position */
#define AFEC_CGR_GAIN7_Msk                    (0x3U << AFEC_CGR_GAIN7_Pos)                   /**< (AFEC_CGR) Gain for Channel 7 Mask */
#define AFEC_CGR_GAIN7(value)                 (AFEC_CGR_GAIN7_Msk & ((value) << AFEC_CGR_GAIN7_Pos))
#define AFEC_CGR_GAIN8_Pos                    (16)                                           /**< (AFEC_CGR) Gain for Channel 8 Position */
#define AFEC_CGR_GAIN8_Msk                    (0x3U << AFEC_CGR_GAIN8_Pos)                   /**< (AFEC_CGR) Gain for Channel 8 Mask */
#define AFEC_CGR_GAIN8(value)                 (AFEC_CGR_GAIN8_Msk & ((value) << AFEC_CGR_GAIN8_Pos))
#define AFEC_CGR_GAIN9_Pos                    (18)                                           /**< (AFEC_CGR) Gain for Channel 9 Position */
#define AFEC_CGR_GAIN9_Msk                    (0x3U << AFEC_CGR_GAIN9_Pos)                   /**< (AFEC_CGR) Gain for Channel 9 Mask */
#define AFEC_CGR_GAIN9(value)                 (AFEC_CGR_GAIN9_Msk & ((value) << AFEC_CGR_GAIN9_Pos))
#define AFEC_CGR_GAIN10_Pos                   (20)                                           /**< (AFEC_CGR) Gain for Channel 10 Position */
#define AFEC_CGR_GAIN10_Msk                   (0x3U << AFEC_CGR_GAIN10_Pos)                  /**< (AFEC_CGR) Gain for Channel 10 Mask */
#define AFEC_CGR_GAIN10(value)                (AFEC_CGR_GAIN10_Msk & ((value) << AFEC_CGR_GAIN10_Pos))
#define AFEC_CGR_GAIN11_Pos                   (22)                                           /**< (AFEC_CGR) Gain for Channel 11 Position */
#define AFEC_CGR_GAIN11_Msk                   (0x3U << AFEC_CGR_GAIN11_Pos)                  /**< (AFEC_CGR) Gain for Channel 11 Mask */
#define AFEC_CGR_GAIN11(value)                (AFEC_CGR_GAIN11_Msk & ((value) << AFEC_CGR_GAIN11_Pos))
#define AFEC_CGR_Msk                          (0x00FFFFFFUL)                                 /**< (AFEC_CGR) Register Mask  */

/* -------- AFEC_DIFFR : (AFEC Offset: 0x60) (R/W 32) AFEC Channel Differential Register -------- */

typedef union
{
  struct
  {
    uint32_t DIFF0:1;                   /**< bit:      0  Differential inputs for channel 0             */
    uint32_t DIFF1:1;                   /**< bit:      1  Differential inputs for channel 1             */
    uint32_t DIFF2:1;                   /**< bit:      2  Differential inputs for channel 2             */
    uint32_t DIFF3:1;                   /**< bit:      3  Differential inputs for channel 3             */
    uint32_t DIFF4:1;                   /**< bit:      4  Differential inputs for channel 4             */
    uint32_t DIFF5:1;                   /**< bit:      5  Differential inputs for channel 5             */
    uint32_t DIFF6:1;                   /**< bit:      6  Differential inputs for channel 6             */
    uint32_t DIFF7:1;                   /**< bit:      7  Differential inputs for channel 7             */
    uint32_t DIFF8:1;                   /**< bit:      8  Differential inputs for channel 8             */
    uint32_t DIFF9:1;                   /**< bit:      9  Differential inputs for channel 9             */
    uint32_t DIFF10:1;                  /**< bit:     10  Differential inputs for channel 10            */
    uint32_t DIFF11:1;                  /**< bit:     11  Differential inputs for channel 11            */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t DIFF:12;                   /**< bit:  0..11  Differential inputs for channel xx            */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_DIFFR_bits_t;

#define AFEC_DIFFR_DIFF0_Pos                  (0)                                            /**< (AFEC_DIFFR) Differential inputs for channel 0 Position */
#define AFEC_DIFFR_DIFF0_Msk                  (0x1U << AFEC_DIFFR_DIFF0_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 0 Mask */
#define AFEC_DIFFR_DIFF1_Pos                  (1)                                            /**< (AFEC_DIFFR) Differential inputs for channel 1 Position */
#define AFEC_DIFFR_DIFF1_Msk                  (0x1U << AFEC_DIFFR_DIFF1_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 1 Mask */
#define AFEC_DIFFR_DIFF2_Pos                  (2)                                            /**< (AFEC_DIFFR) Differential inputs for channel 2 Position */
#define AFEC_DIFFR_DIFF2_Msk                  (0x1U << AFEC_DIFFR_DIFF2_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 2 Mask */
#define AFEC_DIFFR_DIFF3_Pos                  (3)                                            /**< (AFEC_DIFFR) Differential inputs for channel 3 Position */
#define AFEC_DIFFR_DIFF3_Msk                  (0x1U << AFEC_DIFFR_DIFF3_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 3 Mask */
#define AFEC_DIFFR_DIFF4_Pos                  (4)                                            /**< (AFEC_DIFFR) Differential inputs for channel 4 Position */
#define AFEC_DIFFR_DIFF4_Msk                  (0x1U << AFEC_DIFFR_DIFF4_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 4 Mask */
#define AFEC_DIFFR_DIFF5_Pos                  (5)                                            /**< (AFEC_DIFFR) Differential inputs for channel 5 Position */
#define AFEC_DIFFR_DIFF5_Msk                  (0x1U << AFEC_DIFFR_DIFF5_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 5 Mask */
#define AFEC_DIFFR_DIFF6_Pos                  (6)                                            /**< (AFEC_DIFFR) Differential inputs for channel 6 Position */
#define AFEC_DIFFR_DIFF6_Msk                  (0x1U << AFEC_DIFFR_DIFF6_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 6 Mask */
#define AFEC_DIFFR_DIFF7_Pos                  (7)                                            /**< (AFEC_DIFFR) Differential inputs for channel 7 Position */
#define AFEC_DIFFR_DIFF7_Msk                  (0x1U << AFEC_DIFFR_DIFF7_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 7 Mask */
#define AFEC_DIFFR_DIFF8_Pos                  (8)                                            /**< (AFEC_DIFFR) Differential inputs for channel 8 Position */
#define AFEC_DIFFR_DIFF8_Msk                  (0x1U << AFEC_DIFFR_DIFF8_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 8 Mask */
#define AFEC_DIFFR_DIFF9_Pos                  (9)                                            /**< (AFEC_DIFFR) Differential inputs for channel 9 Position */
#define AFEC_DIFFR_DIFF9_Msk                  (0x1U << AFEC_DIFFR_DIFF9_Pos)                 /**< (AFEC_DIFFR) Differential inputs for channel 9 Mask */
#define AFEC_DIFFR_DIFF10_Pos                 (10)                                           /**< (AFEC_DIFFR) Differential inputs for channel 10 Position */
#define AFEC_DIFFR_DIFF10_Msk                 (0x1U << AFEC_DIFFR_DIFF10_Pos)                /**< (AFEC_DIFFR) Differential inputs for channel 10 Mask */
#define AFEC_DIFFR_DIFF11_Pos                 (11)                                           /**< (AFEC_DIFFR) Differential inputs for channel 11 Position */
#define AFEC_DIFFR_DIFF11_Msk                 (0x1U << AFEC_DIFFR_DIFF11_Pos)                /**< (AFEC_DIFFR) Differential inputs for channel 11 Mask */
#define AFEC_DIFFR_Msk                        (0x00000FFFUL)                                 /**< (AFEC_DIFFR) Register Mask  */
#define AFEC_DIFFR_DIFF_Pos                   (0)                                            /**< (AFEC_DIFFR Position) Differential inputs for channel xx */
#define AFEC_DIFFR_DIFF_Msk                   (0xFFFU << AFEC_DIFFR_DIFF_Pos)                /**< (AFEC_DIFFR Mask) DIFF */
#define AFEC_DIFFR_DIFF(value)                (AFEC_DIFFR_DIFF_Msk & ((value) << AFEC_DIFFR_DIFF_Pos))

/* -------- AFEC_CSELR : (AFEC Offset: 0x64) (R/W 32) AFEC Channel Selection Register -------- */

typedef union
{
  struct
  {
    uint32_t CSEL:4;                    /**< bit:   0..3  Channel Selection                             */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CSELR_bits_t;

#define AFEC_CSELR_CSEL_Pos                   (0)                                            /**< (AFEC_CSELR) Channel Selection Position */
#define AFEC_CSELR_CSEL_Msk                   (0xFU << AFEC_CSELR_CSEL_Pos)                  /**< (AFEC_CSELR) Channel Selection Mask */
#define AFEC_CSELR_CSEL(value)                (AFEC_CSELR_CSEL_Msk & ((value) << AFEC_CSELR_CSEL_Pos))
#define AFEC_CSELR_Msk                        (0x0000000FUL)                                 /**< (AFEC_CSELR) Register Mask  */

/* -------- AFEC_CDR : (AFEC Offset: 0x68) (R/ 32) AFEC Channel Data Register -------- */

typedef union
{
  struct
  {
    uint32_t DATA:16;                   /**< bit:  0..15  Converted Data                                */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CDR_bits_t;

#define AFEC_CDR_DATA_Pos                     (0)                                            /**< (AFEC_CDR) Converted Data Position */
#define AFEC_CDR_DATA_Msk                     (0xFFFFU << AFEC_CDR_DATA_Pos)                 /**< (AFEC_CDR) Converted Data Mask */
#define AFEC_CDR_DATA(value)                  (AFEC_CDR_DATA_Msk & ((value) << AFEC_CDR_DATA_Pos))
#define AFEC_CDR_Msk                          (0x0000FFFFUL)                                 /**< (AFEC_CDR) Register Mask  */

/* -------- AFEC_COCR : (AFEC Offset: 0x6c) (R/W 32) AFEC Channel Offset Compensation Register -------- */

typedef union
{
  struct
  {
    uint32_t AOFF:10;                   /**< bit:   0..9  Analog Offset                                 */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_COCR_bits_t;

#define AFEC_COCR_AOFF_Pos                    (0)                                            /**< (AFEC_COCR) Analog Offset Position */
#define AFEC_COCR_AOFF_Msk                    (0x3FFU << AFEC_COCR_AOFF_Pos)                 /**< (AFEC_COCR) Analog Offset Mask */
#define AFEC_COCR_AOFF(value)                 (AFEC_COCR_AOFF_Msk & ((value) << AFEC_COCR_AOFF_Pos))
#define AFEC_COCR_Msk                         (0x000003FFUL)                                 /**< (AFEC_COCR) Register Mask  */

/* -------- AFEC_TEMPMR : (AFEC Offset: 0x70) (R/W 32) AFEC Temperature Sensor Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t RTCT:1;                    /**< bit:      0  Temperature Sensor RTC Trigger Mode           */
    uint32_t :3;                        /**< bit:   1..3  Reserved                                      */
    uint32_t TEMPCMPMOD:2;              /**< bit:   4..5  Temperature Comparison Mode                   */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_TEMPMR_bits_t;

#define AFEC_TEMPMR_RTCT_Pos                  (0)                                            /**< (AFEC_TEMPMR) Temperature Sensor RTC Trigger Mode Position */
#define AFEC_TEMPMR_RTCT_Msk                  (0x1U << AFEC_TEMPMR_RTCT_Pos)                 /**< (AFEC_TEMPMR) Temperature Sensor RTC Trigger Mode Mask */
#define AFEC_TEMPMR_TEMPCMPMOD_Pos            (4)                                            /**< (AFEC_TEMPMR) Temperature Comparison Mode Position */
#define AFEC_TEMPMR_TEMPCMPMOD_Msk            (0x3U << AFEC_TEMPMR_TEMPCMPMOD_Pos)           /**< (AFEC_TEMPMR) Temperature Comparison Mode Mask */
#define AFEC_TEMPMR_TEMPCMPMOD(value)         (AFEC_TEMPMR_TEMPCMPMOD_Msk & ((value) << AFEC_TEMPMR_TEMPCMPMOD_Pos))
#define   AFEC_TEMPMR_TEMPCMPMOD_LOW_Val      (0x0U)                                         /**< (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_HIGH_Val     (0x1U)                                         /**< (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_IN_Val       (0x2U)                                         /**< (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_OUT_Val      (0x3U)                                         /**< (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window.  */
#define AFEC_TEMPMR_TEMPCMPMOD_LOW            (AFEC_TEMPMR_TEMPCMPMOD_LOW_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window. Position  */
#define AFEC_TEMPMR_TEMPCMPMOD_HIGH           (AFEC_TEMPMR_TEMPCMPMOD_HIGH_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window. Position  */
#define AFEC_TEMPMR_TEMPCMPMOD_IN             (AFEC_TEMPMR_TEMPCMPMOD_IN_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window. Position  */
#define AFEC_TEMPMR_TEMPCMPMOD_OUT            (AFEC_TEMPMR_TEMPCMPMOD_OUT_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos)  /**< (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window. Position  */
#define AFEC_TEMPMR_Msk                       (0x00000031UL)                                 /**< (AFEC_TEMPMR) Register Mask  */

/* -------- AFEC_TEMPCWR : (AFEC Offset: 0x74) (R/W 32) AFEC Temperature Compare Window Register -------- */

typedef union
{
  struct
  {
    uint32_t TLOWTHRES:16;              /**< bit:  0..15  Temperature Low Threshold                     */
    uint32_t THIGHTHRES:16;             /**< bit: 16..31  Temperature High Threshold                    */
  };
  uint32_t w;
} __AFEC_TEMPCWR_bits_t;

