zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
#define AFEC_TEMPCWR_TLOWTHRES_Pos            (0)                                            /**< (AFEC_TEMPCWR) Temperature Low Threshold Position */
#define AFEC_TEMPCWR_TLOWTHRES_Msk            (0xFFFFU << AFEC_TEMPCWR_TLOWTHRES_Pos)        /**< (AFEC_TEMPCWR) Temperature Low Threshold Mask */
#define AFEC_TEMPCWR_TLOWTHRES(value)         (AFEC_TEMPCWR_TLOWTHRES_Msk & ((value) << AFEC_TEMPCWR_TLOWTHRES_Pos))
#define AFEC_TEMPCWR_THIGHTHRES_Pos           (16)                                           /**< (AFEC_TEMPCWR) Temperature High Threshold Position */
#define AFEC_TEMPCWR_THIGHTHRES_Msk           (0xFFFFU << AFEC_TEMPCWR_THIGHTHRES_Pos)       /**< (AFEC_TEMPCWR) Temperature High Threshold Mask */
#define AFEC_TEMPCWR_THIGHTHRES(value)        (AFEC_TEMPCWR_THIGHTHRES_Msk & ((value) << AFEC_TEMPCWR_THIGHTHRES_Pos))
#define AFEC_TEMPCWR_Msk                      (0xFFFFFFFFUL)                                 /**< (AFEC_TEMPCWR) Register Mask  */

/* -------- AFEC_ACR : (AFEC Offset: 0x94) (R/W 32) AFEC Analog Control Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t PGA0EN:1;                  /**< bit:      2  PGA0 Enable                                   */
    uint32_t PGA1EN:1;                  /**< bit:      3  PGA1 Enable                                   */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t IBCTL:2;                   /**< bit:   8..9  AFE Bias Current Control                      */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_ACR_bits_t;

#define AFEC_ACR_PGA0EN_Pos                   (2)                                            /**< (AFEC_ACR) PGA0 Enable Position */
#define AFEC_ACR_PGA0EN_Msk                   (0x1U << AFEC_ACR_PGA0EN_Pos)                  /**< (AFEC_ACR) PGA0 Enable Mask */
#define AFEC_ACR_PGA1EN_Pos                   (3)                                            /**< (AFEC_ACR) PGA1 Enable Position */
#define AFEC_ACR_PGA1EN_Msk                   (0x1U << AFEC_ACR_PGA1EN_Pos)                  /**< (AFEC_ACR) PGA1 Enable Mask */
#define AFEC_ACR_IBCTL_Pos                    (8)                                            /**< (AFEC_ACR) AFE Bias Current Control Position */
#define AFEC_ACR_IBCTL_Msk                    (0x3U << AFEC_ACR_IBCTL_Pos)                   /**< (AFEC_ACR) AFE Bias Current Control Mask */
#define AFEC_ACR_IBCTL(value)                 (AFEC_ACR_IBCTL_Msk & ((value) << AFEC_ACR_IBCTL_Pos))
#define AFEC_ACR_Msk                          (0x0000030CUL)                                 /**< (AFEC_ACR) Register Mask  */

/* -------- AFEC_SHMR : (AFEC Offset: 0xa0) (R/W 32) AFEC Sample & Hold Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t DUAL0:1;                   /**< bit:      0  Dual Sample & Hold for channel 0              */
    uint32_t DUAL1:1;                   /**< bit:      1  Dual Sample & Hold for channel 1              */
    uint32_t DUAL2:1;                   /**< bit:      2  Dual Sample & Hold for channel 2              */
    uint32_t DUAL3:1;                   /**< bit:      3  Dual Sample & Hold for channel 3              */
    uint32_t DUAL4:1;                   /**< bit:      4  Dual Sample & Hold for channel 4              */
    uint32_t DUAL5:1;                   /**< bit:      5  Dual Sample & Hold for channel 5              */
    uint32_t DUAL6:1;                   /**< bit:      6  Dual Sample & Hold for channel 6              */
    uint32_t DUAL7:1;                   /**< bit:      7  Dual Sample & Hold for channel 7              */
    uint32_t DUAL8:1;                   /**< bit:      8  Dual Sample & Hold for channel 8              */
    uint32_t DUAL9:1;                   /**< bit:      9  Dual Sample & Hold for channel 9              */
    uint32_t DUAL10:1;                  /**< bit:     10  Dual Sample & Hold for channel 10             */
    uint32_t DUAL11:1;                  /**< bit:     11  Dual Sample & Hold for channel 11             */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t DUAL:12;                   /**< bit:  0..11  Dual Sample & Hold for channel xx             */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_SHMR_bits_t;

#define AFEC_SHMR_DUAL0_Pos                   (0)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 0 Position */
#define AFEC_SHMR_DUAL0_Msk                   (0x1U << AFEC_SHMR_DUAL0_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 0 Mask */
#define AFEC_SHMR_DUAL1_Pos                   (1)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 1 Position */
#define AFEC_SHMR_DUAL1_Msk                   (0x1U << AFEC_SHMR_DUAL1_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 1 Mask */
#define AFEC_SHMR_DUAL2_Pos                   (2)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 2 Position */
#define AFEC_SHMR_DUAL2_Msk                   (0x1U << AFEC_SHMR_DUAL2_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 2 Mask */
#define AFEC_SHMR_DUAL3_Pos                   (3)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 3 Position */
#define AFEC_SHMR_DUAL3_Msk                   (0x1U << AFEC_SHMR_DUAL3_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 3 Mask */
#define AFEC_SHMR_DUAL4_Pos                   (4)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 4 Position */
#define AFEC_SHMR_DUAL4_Msk                   (0x1U << AFEC_SHMR_DUAL4_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 4 Mask */
#define AFEC_SHMR_DUAL5_Pos                   (5)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 5 Position */
#define AFEC_SHMR_DUAL5_Msk                   (0x1U << AFEC_SHMR_DUAL5_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 5 Mask */
#define AFEC_SHMR_DUAL6_Pos                   (6)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 6 Position */
#define AFEC_SHMR_DUAL6_Msk                   (0x1U << AFEC_SHMR_DUAL6_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 6 Mask */
#define AFEC_SHMR_DUAL7_Pos                   (7)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 7 Position */
#define AFEC_SHMR_DUAL7_Msk                   (0x1U << AFEC_SHMR_DUAL7_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 7 Mask */
#define AFEC_SHMR_DUAL8_Pos                   (8)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 8 Position */
#define AFEC_SHMR_DUAL8_Msk                   (0x1U << AFEC_SHMR_DUAL8_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 8 Mask */
#define AFEC_SHMR_DUAL9_Pos                   (9)                                            /**< (AFEC_SHMR) Dual Sample & Hold for channel 9 Position */
#define AFEC_SHMR_DUAL9_Msk                   (0x1U << AFEC_SHMR_DUAL9_Pos)                  /**< (AFEC_SHMR) Dual Sample & Hold for channel 9 Mask */
#define AFEC_SHMR_DUAL10_Pos                  (10)                                           /**< (AFEC_SHMR) Dual Sample & Hold for channel 10 Position */
#define AFEC_SHMR_DUAL10_Msk                  (0x1U << AFEC_SHMR_DUAL10_Pos)                 /**< (AFEC_SHMR) Dual Sample & Hold for channel 10 Mask */
#define AFEC_SHMR_DUAL11_Pos                  (11)                                           /**< (AFEC_SHMR) Dual Sample & Hold for channel 11 Position */
#define AFEC_SHMR_DUAL11_Msk                  (0x1U << AFEC_SHMR_DUAL11_Pos)                 /**< (AFEC_SHMR) Dual Sample & Hold for channel 11 Mask */
#define AFEC_SHMR_Msk                         (0x00000FFFUL)                                 /**< (AFEC_SHMR) Register Mask  */
#define AFEC_SHMR_DUAL_Pos                    (0)                                            /**< (AFEC_SHMR Position) Dual Sample & Hold for channel xx */
#define AFEC_SHMR_DUAL_Msk                    (0xFFFU << AFEC_SHMR_DUAL_Pos)                 /**< (AFEC_SHMR Mask) DUAL */
#define AFEC_SHMR_DUAL(value)                 (AFEC_SHMR_DUAL_Msk & ((value) << AFEC_SHMR_DUAL_Pos))

