zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
/* -------- AFEC_COSR : (AFEC Offset: 0xd0) (R/W 32) AFEC Correction Select Register -------- */

typedef union
{
  struct
  {
    uint32_t CSEL:1;                    /**< bit:      0  Sample & Hold unit Correction Select          */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_COSR_bits_t;

#define AFEC_COSR_CSEL_Pos                    (0)                                            /**< (AFEC_COSR) Sample & Hold unit Correction Select Position */
#define AFEC_COSR_CSEL_Msk                    (0x1U << AFEC_COSR_CSEL_Pos)                   /**< (AFEC_COSR) Sample & Hold unit Correction Select Mask */
#define AFEC_COSR_Msk                         (0x00000001UL)                                 /**< (AFEC_COSR) Register Mask  */

/* -------- AFEC_CVR : (AFEC Offset: 0xd4) (R/W 32) AFEC Correction Values Register -------- */

typedef union
{
  struct
  {
    uint32_t OFFSETCORR:16;             /**< bit:  0..15  Offset Correction                             */
    uint32_t GAINCORR:16;               /**< bit: 16..31  Gain Correction                               */
  };
  uint32_t w;
} __AFEC_CVR_bits_t;

#define AFEC_CVR_OFFSETCORR_Pos               (0)                                            /**< (AFEC_CVR) Offset Correction Position */
#define AFEC_CVR_OFFSETCORR_Msk               (0xFFFFU << AFEC_CVR_OFFSETCORR_Pos)           /**< (AFEC_CVR) Offset Correction Mask */
#define AFEC_CVR_OFFSETCORR(value)            (AFEC_CVR_OFFSETCORR_Msk & ((value) << AFEC_CVR_OFFSETCORR_Pos))
#define AFEC_CVR_GAINCORR_Pos                 (16)                                           /**< (AFEC_CVR) Gain Correction Position */
#define AFEC_CVR_GAINCORR_Msk                 (0xFFFFU << AFEC_CVR_GAINCORR_Pos)             /**< (AFEC_CVR) Gain Correction Mask */
#define AFEC_CVR_GAINCORR(value)              (AFEC_CVR_GAINCORR_Msk & ((value) << AFEC_CVR_GAINCORR_Pos))
#define AFEC_CVR_Msk                          (0xFFFFFFFFUL)                                 /**< (AFEC_CVR) Register Mask  */

/* -------- AFEC_CECR : (AFEC Offset: 0xd8) (R/W 32) AFEC Channel Error Correction Register -------- */

typedef union
{
  struct
  {
    uint32_t ECORR0:1;                  /**< bit:      0  Error Correction Enable for channel 0         */
    uint32_t ECORR1:1;                  /**< bit:      1  Error Correction Enable for channel 1         */
    uint32_t ECORR2:1;                  /**< bit:      2  Error Correction Enable for channel 2         */
    uint32_t ECORR3:1;                  /**< bit:      3  Error Correction Enable for channel 3         */
    uint32_t ECORR4:1;                  /**< bit:      4  Error Correction Enable for channel 4         */
    uint32_t ECORR5:1;                  /**< bit:      5  Error Correction Enable for channel 5         */
    uint32_t ECORR6:1;                  /**< bit:      6  Error Correction Enable for channel 6         */
    uint32_t ECORR7:1;                  /**< bit:      7  Error Correction Enable for channel 7         */
    uint32_t ECORR8:1;                  /**< bit:      8  Error Correction Enable for channel 8         */
    uint32_t ECORR9:1;                  /**< bit:      9  Error Correction Enable for channel 9         */
    uint32_t ECORR10:1;                 /**< bit:     10  Error Correction Enable for channel 10        */
    uint32_t ECORR11:1;                 /**< bit:     11  Error Correction Enable for channel 11        */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t ECORR:12;                  /**< bit:  0..11  Error Correction Enable for channel xx        */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_CECR_bits_t;

#define AFEC_CECR_ECORR0_Pos                  (0)                                            /**< (AFEC_CECR) Error Correction Enable for channel 0 Position */
#define AFEC_CECR_ECORR0_Msk                  (0x1U << AFEC_CECR_ECORR0_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 0 Mask */
#define AFEC_CECR_ECORR1_Pos                  (1)                                            /**< (AFEC_CECR) Error Correction Enable for channel 1 Position */
#define AFEC_CECR_ECORR1_Msk                  (0x1U << AFEC_CECR_ECORR1_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 1 Mask */
#define AFEC_CECR_ECORR2_Pos                  (2)                                            /**< (AFEC_CECR) Error Correction Enable for channel 2 Position */
#define AFEC_CECR_ECORR2_Msk                  (0x1U << AFEC_CECR_ECORR2_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 2 Mask */
#define AFEC_CECR_ECORR3_Pos                  (3)                                            /**< (AFEC_CECR) Error Correction Enable for channel 3 Position */
#define AFEC_CECR_ECORR3_Msk                  (0x1U << AFEC_CECR_ECORR3_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 3 Mask */
#define AFEC_CECR_ECORR4_Pos                  (4)                                            /**< (AFEC_CECR) Error Correction Enable for channel 4 Position */
#define AFEC_CECR_ECORR4_Msk                  (0x1U << AFEC_CECR_ECORR4_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 4 Mask */
#define AFEC_CECR_ECORR5_Pos                  (5)                                            /**< (AFEC_CECR) Error Correction Enable for channel 5 Position */
#define AFEC_CECR_ECORR5_Msk                  (0x1U << AFEC_CECR_ECORR5_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 5 Mask */
#define AFEC_CECR_ECORR6_Pos                  (6)                                            /**< (AFEC_CECR) Error Correction Enable for channel 6 Position */
#define AFEC_CECR_ECORR6_Msk                  (0x1U << AFEC_CECR_ECORR6_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 6 Mask */
#define AFEC_CECR_ECORR7_Pos                  (7)                                            /**< (AFEC_CECR) Error Correction Enable for channel 7 Position */
#define AFEC_CECR_ECORR7_Msk                  (0x1U << AFEC_CECR_ECORR7_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 7 Mask */
#define AFEC_CECR_ECORR8_Pos                  (8)                                            /**< (AFEC_CECR) Error Correction Enable for channel 8 Position */
#define AFEC_CECR_ECORR8_Msk                  (0x1U << AFEC_CECR_ECORR8_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 8 Mask */
#define AFEC_CECR_ECORR9_Pos                  (9)                                            /**< (AFEC_CECR) Error Correction Enable for channel 9 Position */
#define AFEC_CECR_ECORR9_Msk                  (0x1U << AFEC_CECR_ECORR9_Pos)                 /**< (AFEC_CECR) Error Correction Enable for channel 9 Mask */
#define AFEC_CECR_ECORR10_Pos                 (10)                                           /**< (AFEC_CECR) Error Correction Enable for channel 10 Position */
#define AFEC_CECR_ECORR10_Msk                 (0x1U << AFEC_CECR_ECORR10_Pos)                /**< (AFEC_CECR) Error Correction Enable for channel 10 Mask */
#define AFEC_CECR_ECORR11_Pos                 (11)                                           /**< (AFEC_CECR) Error Correction Enable for channel 11 Position */
#define AFEC_CECR_ECORR11_Msk                 (0x1U << AFEC_CECR_ECORR11_Pos)                /**< (AFEC_CECR) Error Correction Enable for channel 11 Mask */
#define AFEC_CECR_Msk                         (0x00000FFFUL)                                 /**< (AFEC_CECR) Register Mask  */
#define AFEC_CECR_ECORR_Pos                   (0)                                            /**< (AFEC_CECR Position) Error Correction Enable for channel xx */
#define AFEC_CECR_ECORR_Msk                   (0xFFFU << AFEC_CECR_ECORR_Pos)                /**< (AFEC_CECR Mask) ECORR */
#define AFEC_CECR_ECORR(value)                (AFEC_CECR_ECORR_Msk & ((value) << AFEC_CECR_ECORR_Pos))

/* -------- AFEC_WPMR : (AFEC Offset: 0xe4) (R/W 32) AFEC Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protect KEY                             */
  };
  uint32_t w;
} __AFEC_WPMR_bits_t;

#define AFEC_WPMR_WPEN_Pos                    (0)                                            /**< (AFEC_WPMR) Write Protection Enable Position */
#define AFEC_WPMR_WPEN_Msk                    (0x1U << AFEC_WPMR_WPEN_Pos)                   /**< (AFEC_WPMR) Write Protection Enable Mask */
#define AFEC_WPMR_WPKEY_Pos                   (8)                                            /**< (AFEC_WPMR) Write Protect KEY Position */
#define AFEC_WPMR_WPKEY_Msk                   (0xFFFFFFU << AFEC_WPMR_WPKEY_Pos)             /**< (AFEC_WPMR) Write Protect KEY Mask */
#define AFEC_WPMR_WPKEY(value)                (AFEC_WPMR_WPKEY_Msk & ((value) << AFEC_WPMR_WPKEY_Pos))
#define   AFEC_WPMR_WPKEY_PASSWD_Val          (0x414443U)                                    /**< (AFEC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define AFEC_WPMR_WPKEY_PASSWD                (AFEC_WPMR_WPKEY_PASSWD_Val << AFEC_WPMR_WPKEY_Pos)  /**< (AFEC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define AFEC_WPMR_Msk                         (0xFFFFFF01UL)                                 /**< (AFEC_WPMR) Register Mask  */

/* -------- AFEC_WPSR : (AFEC Offset: 0xe8) (R/ 32) AFEC Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protect Violation Status                */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protect Violation Source                */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __AFEC_WPSR_bits_t;

#define AFEC_WPSR_WPVS_Pos                    (0)                                            /**< (AFEC_WPSR) Write Protect Violation Status Position */
#define AFEC_WPSR_WPVS_Msk                    (0x1U << AFEC_WPSR_WPVS_Pos)                   /**< (AFEC_WPSR) Write Protect Violation Status Mask */
#define AFEC_WPSR_WPVSRC_Pos                  (8)                                            /**< (AFEC_WPSR) Write Protect Violation Source Position */
#define AFEC_WPSR_WPVSRC_Msk                  (0xFFFFU << AFEC_WPSR_WPVSRC_Pos)              /**< (AFEC_WPSR) Write Protect Violation Source Mask */
#define AFEC_WPSR_WPVSRC(value)               (AFEC_WPSR_WPVSRC_Msk & ((value) << AFEC_WPSR_WPVSRC_Pos))
#define AFEC_WPSR_Msk                         (0x00FFFF01UL)                                 /**< (AFEC_WPSR) Register Mask  */

/** \brief AFEC register offsets definitions */
#define AFEC_CR_OFFSET               (0x00)         /**< (AFEC_CR) AFEC Control Register Offset */
#define AFEC_MR_OFFSET               (0x04)         /**< (AFEC_MR) AFEC Mode Register Offset */
#define AFEC_EMR_OFFSET              (0x08)         /**< (AFEC_EMR) AFEC Extended Mode Register Offset */
#define AFEC_SEQ1R_OFFSET            (0x0C)         /**< (AFEC_SEQ1R) AFEC Channel Sequence 1 Register Offset */
#define AFEC_SEQ2R_OFFSET            (0x10)         /**< (AFEC_SEQ2R) AFEC Channel Sequence 2 Register Offset */
#define AFEC_CHER_OFFSET             (0x14)         /**< (AFEC_CHER) AFEC Channel Enable Register Offset */
#define AFEC_CHDR_OFFSET             (0x18)         /**< (AFEC_CHDR) AFEC Channel Disable Register Offset */
#define AFEC_CHSR_OFFSET             (0x1C)         /**< (AFEC_CHSR) AFEC Channel Status Register Offset */
#define AFEC_LCDR_OFFSET             (0x20)         /**< (AFEC_LCDR) AFEC Last Converted Data Register Offset */
#define AFEC_IER_OFFSET              (0x24)         /**< (AFEC_IER) AFEC Interrupt Enable Register Offset */
#define AFEC_IDR_OFFSET              (0x28)         /**< (AFEC_IDR) AFEC Interrupt Disable Register Offset */
#define AFEC_IMR_OFFSET              (0x2C)         /**< (AFEC_IMR) AFEC Interrupt Mask Register Offset */
#define AFEC_ISR_OFFSET              (0x30)         /**< (AFEC_ISR) AFEC Interrupt Status Register Offset */
#define AFEC_OVER_OFFSET             (0x4C)         /**< (AFEC_OVER) AFEC Overrun Status Register Offset */
#define AFEC_CWR_OFFSET              (0x50)         /**< (AFEC_CWR) AFEC Compare Window Register Offset */
#define AFEC_CGR_OFFSET              (0x54)         /**< (AFEC_CGR) AFEC Channel Gain Register Offset */
#define AFEC_DIFFR_OFFSET            (0x60)         /**< (AFEC_DIFFR) AFEC Channel Differential Register Offset */
#define AFEC_CSELR_OFFSET            (0x64)         /**< (AFEC_CSELR) AFEC Channel Selection Register Offset */
#define AFEC_CDR_OFFSET              (0x68)         /**< (AFEC_CDR) AFEC Channel Data Register Offset */
#define AFEC_COCR_OFFSET             (0x6C)         /**< (AFEC_COCR) AFEC Channel Offset Compensation Register Offset */
#define AFEC_TEMPMR_OFFSET           (0x70)         /**< (AFEC_TEMPMR) AFEC Temperature Sensor Mode Register Offset */
#define AFEC_TEMPCWR_OFFSET          (0x74)         /**< (AFEC_TEMPCWR) AFEC Temperature Compare Window Register Offset */
#define AFEC_ACR_OFFSET              (0x94)         /**< (AFEC_ACR) AFEC Analog Control Register Offset */
#define AFEC_SHMR_OFFSET             (0xA0)         /**< (AFEC_SHMR) AFEC Sample & Hold Mode Register Offset */
#define AFEC_COSR_OFFSET             (0xD0)         /**< (AFEC_COSR) AFEC Correction Select Register Offset */
#define AFEC_CVR_OFFSET              (0xD4)         /**< (AFEC_CVR) AFEC Correction Values Register Offset */
#define AFEC_CECR_OFFSET             (0xD8)         /**< (AFEC_CECR) AFEC Channel Error Correction Register Offset */
#define AFEC_WPMR_OFFSET             (0xE4)         /**< (AFEC_WPMR) AFEC Write Protection Mode Register Offset */
#define AFEC_WPSR_OFFSET             (0xE8)         /**< (AFEC_WPSR) AFEC Write Protection Status Register Offset */

