zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/afec.h
/** \brief AFEC register API structure */
typedef struct
{
  __O   __AFEC_CR_bits_t               AFEC_CR;       /**< Offset: 0x00 ( /W  32) AFEC Control Register */
  __IO  __AFEC_MR_bits_t               AFEC_MR;       /**< Offset: 0x04 (R/W  32) AFEC Mode Register */
  __IO  __AFEC_EMR_bits_t              AFEC_EMR;      /**< Offset: 0x08 (R/W  32) AFEC Extended Mode Register */
  __IO  __AFEC_SEQ1R_bits_t            AFEC_SEQ1R;    /**< Offset: 0x0C (R/W  32) AFEC Channel Sequence 1 Register */
  __IO  __AFEC_SEQ2R_bits_t            AFEC_SEQ2R;    /**< Offset: 0x10 (R/W  32) AFEC Channel Sequence 2 Register */
  __O   __AFEC_CHER_bits_t             AFEC_CHER;     /**< Offset: 0x14 ( /W  32) AFEC Channel Enable Register */
  __O   __AFEC_CHDR_bits_t             AFEC_CHDR;     /**< Offset: 0x18 ( /W  32) AFEC Channel Disable Register */
  __I   __AFEC_CHSR_bits_t             AFEC_CHSR;     /**< Offset: 0x1C (R/   32) AFEC Channel Status Register */
  __I   __AFEC_LCDR_bits_t             AFEC_LCDR;     /**< Offset: 0x20 (R/   32) AFEC Last Converted Data Register */
  __O   __AFEC_IER_bits_t              AFEC_IER;      /**< Offset: 0x24 ( /W  32) AFEC Interrupt Enable Register */
  __O   __AFEC_IDR_bits_t              AFEC_IDR;      /**< Offset: 0x28 ( /W  32) AFEC Interrupt Disable Register */
  __I   __AFEC_IMR_bits_t              AFEC_IMR;      /**< Offset: 0x2C (R/   32) AFEC Interrupt Mask Register */
  __I   __AFEC_ISR_bits_t              AFEC_ISR;      /**< Offset: 0x30 (R/   32) AFEC Interrupt Status Register */
  __I   uint8_t                        Reserved1[0x18];
  __I   __AFEC_OVER_bits_t             AFEC_OVER;     /**< Offset: 0x4C (R/   32) AFEC Overrun Status Register */
  __IO  __AFEC_CWR_bits_t              AFEC_CWR;      /**< Offset: 0x50 (R/W  32) AFEC Compare Window Register */
  __IO  __AFEC_CGR_bits_t              AFEC_CGR;      /**< Offset: 0x54 (R/W  32) AFEC Channel Gain Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  __AFEC_DIFFR_bits_t            AFEC_DIFFR;    /**< Offset: 0x60 (R/W  32) AFEC Channel Differential Register */
  __IO  __AFEC_CSELR_bits_t            AFEC_CSELR;    /**< Offset: 0x64 (R/W  32) AFEC Channel Selection Register */
  __I   __AFEC_CDR_bits_t              AFEC_CDR;      /**< Offset: 0x68 (R/   32) AFEC Channel Data Register */
  __IO  __AFEC_COCR_bits_t             AFEC_COCR;     /**< Offset: 0x6C (R/W  32) AFEC Channel Offset Compensation Register */
  __IO  __AFEC_TEMPMR_bits_t           AFEC_TEMPMR;   /**< Offset: 0x70 (R/W  32) AFEC Temperature Sensor Mode Register */
  __IO  __AFEC_TEMPCWR_bits_t          AFEC_TEMPCWR;  /**< Offset: 0x74 (R/W  32) AFEC Temperature Compare Window Register */
  __I   uint8_t                        Reserved3[0x1C];
  __IO  __AFEC_ACR_bits_t              AFEC_ACR;      /**< Offset: 0x94 (R/W  32) AFEC Analog Control Register */
  __I   uint8_t                        Reserved4[0x08];
  __IO  __AFEC_SHMR_bits_t             AFEC_SHMR;     /**< Offset: 0xA0 (R/W  32) AFEC Sample & Hold Mode Register */
  __I   uint8_t                        Reserved5[0x2C];
  __IO  __AFEC_COSR_bits_t             AFEC_COSR;     /**< Offset: 0xD0 (R/W  32) AFEC Correction Select Register */
  __IO  __AFEC_CVR_bits_t              AFEC_CVR;      /**< Offset: 0xD4 (R/W  32) AFEC Correction Values Register */
  __IO  __AFEC_CECR_bits_t             AFEC_CECR;     /**< Offset: 0xD8 (R/W  32) AFEC Channel Error Correction Register */
  __I   uint8_t                        Reserved6[0x08];
  __IO  __AFEC_WPMR_bits_t             AFEC_WPMR;     /**< Offset: 0xE4 (R/W  32) AFEC Write Protection Mode Register */
  __I   __AFEC_WPSR_bits_t             AFEC_WPSR;     /**< Offset: 0xE8 (R/   32) AFEC Write Protection Status Register */
} afec_registers_t;
/** @}  end of Analog Front-End Controller */

#endif /* _PIC32CZ_CA70_AFEC_COMPONENT_H_ */
